[{"short_name": "CHEM 104", "title": "General Chemistry I", "faculty": "CHEM", "credit": "3", "description": "An introduction to the fundamental principles of chemistry. Topics discussed will include atomic structure, bonding, stoichiometry, enthalpy, solutions, organic compounds. Lab component: Introduction to standard chemistry laboratory techniques.", "prerequisite": "CHEM 30 or CHEM 100 (minimum 65%); and Precalculus 30 or Mathematics C30 with a grade of at least 65%, or AMTH 092 with a grade of at least 80%, or MATH 102."}, {"short_name": "ENGG 123", "title": "Engineering Design and Communications", "faculty": "ENGG", "credit": "3", "description": ["Students will be introduced to the concepts of engineering design and communications.  In addition, the consequences of engineering projects on society will be explored.", "    0.000 OR     3.", "    0.000 OR     3.", "    0.000 OR     3."], "prerequisite": ""}, {"short_name": "ENGG 140", "title": "Mechanics for EngineersStatics", "faculty": "ENGG", "credit": "3", "description": "Introduction to engineering mechanics including: force vectors , statics of particles and rigid bodies, centroids, mass centres, construction of free-body diagrams, analysis of structure, internal loads of structures and cables, distributed forces, moments of intertia and friction.", "prerequisite": "MATH 110 (May be take concurrently)"}, {"short_name": "ENGG 100", "title": "Engineering Graphics", "faculty": "ENGG", "credit": "3", "description": ["Fundamentals of graphical communication and analysis. Manual and computer-aided sketching and drawing techniques; orthographic and pictorial projections; multi-view, isometric and oblique drawings; basic descriptive geometry; introduction to working drawings.", "    0.000 OR     3.", "    0.000 OR     3.", "    0.000 OR     4.", "    0.000 OR     1."], "prerequisite": ""}, {"short_name": "ENGG 303", "title": "Engineering Economics and Project Management", "faculty": "ENGG", "credit": "3", "description": "Fundamentals of engineering economics and project financials.Social and environmental design making, time value of money, cash flows, interest, equivalence, cost estimation and comparative costing, replacement analysis, capital projects, sensitivity analysis, balance sheets. Project management concepts, skills, tools and techniques including cost, scope, quality, resources, communication, risk, procurement and stakeholder management.", "prerequisite": "STAT 160 or STAT 289 and ECON 201"}, {"short_name": "MATH 110", "title": "Calculus I", "faculty": "MATH", "credit": "3", "description": "An introductory class in the theory and techniques of differentiation and integration of algebraic and trigonometric functions. Topics include limits, optimization, curve sketching, and areas.", "prerequisite": "Precalculus 30 with at least 75%, or Calculus 30 or Mathematics B30 and C30 with a grade of at least 65% in each or Math 102"}, {"short_name": "MATH 122", "title": "Linear Algebra I", "faculty": "MATH", "credit": "3", "description": "A course intended to introduce students to elementary linear algebra, particularly at a computational and applied level. Topics include matrices and systems of equations, inversion, determinants, vectors, inner products, eigenvectors and eigenvalues.", "prerequisite": "Precalculus 30, Mathematics B30 and C30, or Math 102."}, {"short_name": "MATH 111", "title": "Calculus II", "faculty": "MATH", "credit": "3", "description": "Differentiation and integration of exponential and logarithmic functions; methods of integration and applications; indeterminate forms, L'Hospital's rule and improper integrals; sequences, series, power series and Taylor series.", "prerequisite": "MATH 110, or MATH 103 with a grade of at least 80%"}, {"short_name": "MATH 213", "title": "Vector Calculus", "faculty": "MATH", "credit": "3", "description": "A study of vector functions and functions of several variables and their derivatives; Applied maximum and minimum problems, Lagrange multipliers, multiple integration, integration in polar, cylindrical and spherical coordinates; Green's, Stokes' and the Divergence Theorem.", "prerequisite": "MATH 111 and 122"}, {"short_name": "CS 110", "title": "Programming and Problem Solving", "faculty": "CS", "credit": "3", "description": "An introduction to problem-solving techniques, the fundamental concepts of programming, and the software design process. Topics will include: data types, control structures, scope rules, functions, files, and the mechanics of running, testing and debugging. Problems will be drawn from various science disciplines.", "prerequisite": "Precalculus 30, Calculus 30, or Math 102"}, {"short_name": "CS 115", "title": "Object-Oriented Design", "faculty": "CS", "credit": "3", "description": "This course focuses on the concepts of object-oriented programming. Topics include data abstraction, classes, composition and inheritance, subtyping, dynamic binding, polymorphism and dynamic memory management. Other topics include type systems, two-dimensional arrays, records, references, searching and sorting algorithms, language translation. Software engineering: comprehensibility, correctness, efficiency, refactoring.", "prerequisite": "CS 110 with a minimum grade of 65% and one of MATH 110 (may be taken concurrently) or MATH 103 with a minimum grade of 80%."}, {"short_name": "CS 210", "title": "Data Structures and Abstractions", "faculty": "CS", "credit": "3", "description": "This course introduces data abstraction, data structures and their implementations, the basics of algorithmic analysis, and the fundamental computing algorithms. Topics include stacks, queues, heaps, recursion, Master Theorem, asymptotic notation, computational complexity, empirical performance measurement, recursion based sorting algorithms, hashing, and trees (including binary trees, B-trees, and AVL trees).", "prerequisite": "CS 115 and MATH 110"}, {"short_name": "CS 215", "title": "Web and Database Programming", "faculty": "CS", "credit": "3", "description": "This course shows how interactive database-driven web applications are designed and implemented. Appropriate protocols and languages for web and database programming will be discussed, with a focus on client-server architectures, interface design, graphics and visualization, event-driven programming, information management, data modeling, and database systems.", "prerequisite": "CS 210"}, {"short_name": "CS 340", "title": "Advanced Data Structures and Algorithm Design", "faculty": "CS", "credit": "3", "description": "Fundamental algorithms: depth- and breadth-first traversals, pattern matching, and graph algorithms. Algorithmic strategies: brute-force, greedy, divide-and-conquer, backtracking, branch-and-bound, dynamic programming, and randomized. Algorithm analysis, complexity theory, performance evaluation. Parallelism: fundamentals, algorithms, communication.", "prerequisite": "CS 210"}, {"short_name": "CS 205", "title": "Introduction to Multimedia Systems", "faculty": "CS", "credit": "3", "description": "Multimedia is the use of computers to integrate texts, graphics, video, animation, and sound in an interactive experience. The course introduces these elements of multimedia and their associated technologies. Students will gain an appreciation of each element and be able to combine them into a finished work.", "prerequisite": "CS 110"}, {"short_name": "CS 315", "title": "Introduction to Computer Graphics", "faculty": "CS", "credit": "3", "description": "Introduction to graphics hardware and software. Two-dimensional graphics rendering algorithms. Basic three-dimensional modeling, transformations, viewing geometry, lighting and shading,  hidden surface removel, and texture mapping.", "prerequisite": "CS210 and MATH 122"}, {"short_name": "CS 330", "title": "Introduction to Operating Systems", "faculty": "CS", "credit": "3", "description": "Overview of operating systems: functionality, and design issues. Operating system principles: structures, abstractions, APIs, resource allocation, proximity, virtualization. Concurrency: process state, context switches, process communication, synchronization. Scheduling: preemption, schedulers, processes, and threads. Memory management. Security and protection. File systems. User interface. Distributed algorithms: consensus, termination, and fault tolerance.", "prerequisite": "CS 210"}, {"short_name": "CS 350", "title": "Programming Language Concepts", "faculty": "CS", "credit": "3", "description": "Programming language genealogy and design. Imperative, functional, and object-oriented language paradigms. Context-free grammars and syntax trees. Data types, control structures, exception handling, data abstraction, information hiding, and non-determinism. Program representation, translation, and execution. Functional programming: advantages, constructs, closures, and higher-order operations. Parallel programming.", "prerequisite": "CS 210"}, {"short_name": "CS 375", "title": "Database and Information Retrieval", "faculty": "CS", "credit": "3", "description": "Information management: concepts and applications. Motivation for database systems. Components of database systems. Data modeling: conceptual, spreadsheet, relational, object-oriented, and semi-structured models. Querying and database query languages. Caching and transaction processing. Other topics include distributed databases, physical database design, and information retrieval systems.", "prerequisite": "CS 215"}, {"short_name": "CS 405", "title": "Computer Graphics", "faculty": "CS", "credit": "3", "description": "Advanced topics in computer graphics, including special modeling techniques for natural phenomenon, advanced illumination models and rendering algorithms.", "prerequisite": "CS 315"}, {"short_name": "CS 425", "title": "Image Processing", "faculty": "CS", "credit": "3", "description": "Introduction to image processing systems.  Image transformation.  Image enhancement.  Image coding and compression.  Feature extraction and image segmentation.", "prerequisite": "CS 340, MATH 111 and 122"}, {"short_name": "CS 427", "title": "Introduction to Computer Audio", "faculty": "CS", "credit": "3", "description": "The purpose of this course is to provide a broad overview of many areas of computer audio, including: Digital representation and compression; Psychoacoustics; Surround Sound; Speech recognition and Music Information Retrieval; MIDI and New interfaces for music; and video game sound. We will also explore modular interactive software environments such as Max/MSP and PD.", "prerequisite": "CS 315, or CS 320, or CS 340"}, {"short_name": "ENGL 100", "title": "Critical Reading and Writing I", "faculty": "ENGL", "credit": "3", "description": ["This course develops students' proficiency in critical reading and writing through the study of a wide range of non-literary and literary texts, and the study of composition, with emphasis on connections between modes of reading and writing.", "    0.000 OR     3.", "    0.000 OR     3.", "    0.000 OR     1."], "prerequisite": ""}, {"short_name": "PHYS 119", "title": "General Physics II", "faculty": "PHYS", "credit": "3", "description": "A continuation of PHYS 109: Fluid mechanics, heat and thermodynamics, waves, sound, radiation, electrostatics and electric current.", "prerequisite": "PHYS 109 or ENGG 140"}, {"short_name": "ENEL 281", "title": "Signals, Circuits, and Systems", "faculty": "ENEL", "credit": "3", "description": "The introductory aspects of signals, circuits and systems including: AC circuit analysis,frequency response, resonance, passive and active filters, second order transient analysis, conversion between time domain and frequency domain signals using the Laplace and Fourier Transforms.", "prerequisite": " MATH 217 (concurrent enrolment allowed) and ENEL 280"}, {"short_name": "ENEL 282", "title": "Semiconductor Devices", "faculty": "ENEL", "credit": "3", "description": "Semiconductor materials and conduction principles.  The characteristics of common semiconductor devices, including: PN junction diodes, bipolar and field effect transistors, thyristors and photodiodes.  Linear models, circuit analysis and application examples.", "prerequisite": "ENEL 280"}, {"short_name": "ENEL 384", "title": "Digital Electronics", "faculty": "ENEL", "credit": "3", "description": "The introductory aspects of digital electronic circuits, including basic principles of digital systems, logic function and gates, boolean algebra and combinational logic,\nintroduction to VHDL, introduction to FPGAs, combinational logic functions,\ndigital arithmetic and arithmetic circuits, introduction to sequential logic, counters\nand shift registers, and state machine design.", "prerequisite": "ENEL 282"}, {"short_name": "ENEL 380", "title": "Automation and Control", "faculty": "ENEL", "credit": "3", "description": "Programmable logic controllers, ladder logic, latches, timers, counters, flow control, and data handling instructions, sensors and actuators, state based design. Open & closed loop systems, mathematical modeling, Laplace transform, block diagrams and signal flow graphs, design and analysis of feedback systems, stability analysis, root locus, PID controllers, frequency domain technique.", "prerequisite": "ENIN 233 or ENEL 281 and ENEL 280"}, {"short_name": "ENEL 387", "title": "Microcontroller System Design", "faculty": "ENEL", "credit": "3", "description": "Design of microcontroller systems, including interfacing analog and digital circuits,\nmemory and peripheral devices, processor architecture, memory systems,\nexceptions, interrupt control, and exception programming. Students will build an\nintegrated microcontroller system in their final lab project.", "prerequisite": "ENSE 352 and ENEL 384"}, {"short_name": "ENEL 487", "title": "Embedded and Real-Time Software Systems", "faculty": "ENEL", "credit": "3", "description": "Software design practises for resource-constrained targets. Students will design and implement a number of embedded components, culminating by integrating them into a full embedded system involving aspects of feedback control, signal processing, or communications. Topics: Architectures for real-time systems. Fundamentals of real-time operating systems. Software design. Interfacing and communications. Speed, memory, and power performance tradeoffs. Testing. Dependability.", "prerequisite": "ENEL 387 and CS 210"}, {"short_name": "ENEL 489", "title": "FPGA Design Using VHDL", "faculty": "ENEL", "credit": "3", "description": "Introduction to FPGA digital system design. Students will learn a high-level hardware design language (VHDL), the concurrent and sequential statements of VHDL, the principle and practice of combinational circuit design, the principle and practice of sequential circuit design, Finite State Machine, Register Transfer Methodology, the synthesis and implementation of digital design on a FPGA device. Advanced synchronous digital design 3 techniques such as pipelining, parallelism, and caching. Students will develop a design and test it on an FPGA development board.", "prerequisite": "ENEL 384"}, {"short_name": "STAT 289", "title": "Statistics for Engineers", "faculty": "STAT", "credit": "3", "description": "Topics include probability, discrete and continuous distributions, the central limit theorem, confidence intervals and hypothesis tests for one and two samples, linear regression and correlation.", "prerequisite": "MATH 111"}, {"short_name": "ENSE 352", "title": "Fundamentals of Computer Systems Architectures", "faculty": "ENSE", "credit": "3", "description": "The course aims at providing the basic understanding of computer architecture.  Topics include handheld device architecture, operating systems, component software design, and concurrent processing.   Students are introduced to software concepts such as threading, remote procedure calls, multitasking, deadlocks, and concurrency.", "prerequisite": "CS 210 and ENEL 384 (concurrent enrollment is allowed)"}, {"short_name": "ENSE 374", "title": "Software Engineering Management", "faculty": "ENSE", "credit": "3", "description": "Principles of software engineering: requirements, design and testing. Review of principles of object orientation. Object oriented analysis using UML. Frameworks and APIs. Introduction to the client-server architecture. Analysis, design and programming of simple servers and clients. Introduction to user interface technology.", "prerequisite": "CS 210"}, {"short_name": "ENSE 353", "title": "Software Design and Architecture", "faculty": "ENSE", "credit": "3", "description": "Modeling and design of flexible software at the architectural level. Basics of model-driven architecture. Architectural styles and patterns. Middleware and application frameworks. Configurations and configuration management. Product lines. Design using Commercial Off-The-Shelf (COTS) software.", "prerequisite": "CS 215"}, {"short_name": "ENSE 400", "title": "ENSE Project Start-up", "faculty": "ENSE", "credit": "1", "description": "Students are given the opportunity to propose, develop and present engineering design projects which they are expected to further pursue in ENSE 477.  Issues of safety, feasibility, and engineering responsibility are discussed.  Student form design teams in this class and are expected to write a project plan document, compose a preliminary design document, and present their project to their fellow students.", "prerequisite": "ENSE 470 and successful completion of 99 credit hours"}, {"short_name": "ENSE 472", "title": "Digital Networks", "faculty": "ENSE", "credit": "3", "description": "Introduction to information theory; network architectures and LAN implementation/configuration; network administration principles; communication protocols (i.e. TCP/IP stack );   internet applications, wireless networks, physical lines (i.e. fibre, twisted pair, coax), network performance, troubleshooting and system security.", "prerequisite": "CS 215"}, {"short_name": "ENSE 350", "title": "Mathematical Programming for Software Engineers", "faculty": "ENSE", "credit": "3", "description": "Fundamental concepts of discrete mathematics (definitions, proofs, sets), discrete structures (graphs, state machines, modular arithmetic), algorithm complexity models, and numerical methods in engineering.", "prerequisite": "Math 110, 122 and CS 210"}, {"short_name": "ENSE 477", "title": "Software Systems Engineering Design Project", "faculty": "ENSE", "credit": "3", "description": "Development of significant software system, employing knowledge gained from courses throughout the program. This includes development of requirements, design, implementation, and quality assurance. Students follow a suitable process model and manage the project themselves, following appropriate project management techniques.", "prerequisite": "ENSE 400 and ENSE 470"}, {"short_name": "ENSE 474", "title": "Software Process Management", "faculty": "ENSE", "credit": "3", "description": "Software processes: standards, implementation, and assurance. Project management with a focus on requirements management and long-term evolution: Eliciting and prioritizing requirements, cost estimation, planning and tracking projects, risk analysis, project control, change management.", "prerequisite": "ENSE 374"}, {"short_name": "ENSE 479", "title": "Engineering Concepts in Sound Art", "faculty": "ENSE", "credit": "3", "description": "This course introduces the artistic practice and engineering design concepts within sound art. It covers a range of sound art practices including avant-garde sound, Musique Concrete, sound and 1960s art movements, electroacoustic music, sound sculpture, radio art, Acoustic Ecology, community-engaged sound art, sound art in performance, and engineering design concepts of new media.", "prerequisite": " Successful completion of 30 credit hours or permission of Program Chair"}, {"short_name": "ENSE 480", "title": "Knowledge Base and Information Systems", "faculty": "ENSE", "credit": "3", "description": "This course analyzes the fundamentals of industrial knowledge management. Students will learn how to analyze a company and how to produce an information system.  Topics include the fundamentals of Knowledge Base Management Information Systems and their impact on the business process, engineering an information system, Workflow Management Design, and reengineering for change management.", "prerequisite": " ENSE 353 or completion of 81 SSE program related credit hours or permission of Program Chair"}, {"short_name": "ENSE 481", "title": "Embedded Systems and Co-design", "faculty": "ENSE", "credit": "3", "description": "Embedded systems are increasingly common in modern systems design.  This course will teach students how to take advantage of embedded systems technology in their system designs.  Topics include: advanced microcontroller real-time design, co-design, embedded systems design issues, power considerations, and wireless considerations.", "prerequisite": "ENEL 387 and ENEL 487"}, {"short_name": "ENSE 482", "title": "New Media Technology", "faculty": "ENSE", "credit": "3", "description": "This course aims to provide a basic level of understanding to make it possible for engineers to work with designers and understand some of the constraints within New Media design.  Topics include: definition of New Media, New Media narratives, Multimedia, integration, intermedia, the basic tools, and New Media design.", "prerequisite": "ENSE 374"}, {"short_name": "ENSE 483", "title": "Digital Wireless Systems", "faculty": "ENSE", "credit": "3", "description": "This course provides the skills necessary to understand and use systems from the point of view of protocol, bandwidth, and spectrum allocation.  Topics include spectrum allocation, digital modulation, spread-spectrum communications fundamentals, digital radio protocols for modern wireless systems, working with CDPD, Bluetooth, and IEE 802.11a/b, interference and collision.", "prerequisite": "ENSE 374"}, {"short_name": "BUS 260", "title": "Introduction to Organizational Behaviour", "faculty": "BUS", "credit": "3", "description": "This introductory course addresses the basic concepts and processes of organizational behaviour. Topics will include:  individual level variables, such as perception, personality, attitudes, and motivation; interpersonal and group processes, such as communication, teams, leadership, and power; and, organizational level factors such as organizational design, culture, and change.", "prerequisite": "ENGL 100, or ACAD 100, or KIN 101."}, {"short_name": "ECON 201", "title": "Introductory Microeconomics", "faculty": "ECON", "credit": "3", "description": "Theory of how individual consumers and firms behave in a market economy. Emphasis is on evaluating how well markets deliver efficient and fair outcomes.", "prerequisite": "15 credit hours or ECON 100 or Pre-Calculus 20 (or equivalent)"}]