[
  {
    "short_name": "CHEM 104",
    "title": "General Chemistry I",
    "faculty": "CHEM",
    "credit": "3",
    "description": "An introduction to the fundamental principles of chemistry. Topics discussed will include atomic structure, bonding, stoichiometry, enthalpy, solutions, organic compounds. Lab component: Introduction to standard chemistry laboratory techniques.",
    "prerequisite": "CHEM 30 or CHEM 100 (minimum 65%); and Precalculus 30 or Mathematics C30 with a grade of at least 65%, or AMTH 092 with a grade of at least 80%, or MATH 102."
  },
  {
    "short_name": "CHEM 140",
    "title": "Organic Chemistry I",
    "faculty": "CHEM",
    "credit": "3",
    "description": "An introduction to organic chemistry. Organic functional groups, nomenclature, reactions and mechanisms. Lab component: Introduction to organic laboratory techniques.",
    "prerequisite": "CHEM 104"
  },
  {
    "short_name": "CHEM 105",
    "title": "General Chemistry II",
    "faculty": "CHEM",
    "credit": "3",
    "description": "A continuation of CHEM 104. Topics discussed will include kinetics, equilibrium, acids and bases, buffers, plastics, entropy and free energy, electrochemistry, nuclear chemistry. Lab component: Basic experiments demonstrating principles of equilibrium, thermodynamics, electrochemistry, and acids and bases.",
    "prerequisite": "CHEM 104"
  },
  {
    "short_name": "ENGG 123",
    "title": "Engineering Design and Communications",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Students will be introduced to the concepts of engineering design and communications.  In addition, the consequences of engineering projects on society will be explored.",
    "prerequisite": ""
  },
  {
    "short_name": "ENGG 140",
    "title": "Mechanics for EngineersStatics",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Introduction to engineering mechanics including: force vectors , statics of particles and rigid bodies, centroids, mass centres, construction of free-body diagrams, analysis of structure, internal loads of structures and cables, distributed forces, moments of intertia and friction.",
    "prerequisite": "MATH 110 (May be take concurrently)"
  },
  {
    "short_name": "ENGG 100",
    "title": "Engineering Graphics",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Fundamentals of graphical communication and analysis. Manual and computer-aided sketching and drawing techniques; orthographic and pictorial projections; multi-view, isometric and oblique drawings; basic descriptive geometry; introduction to working drawings.",
    "prerequisite": ""
  },
  {
    "short_name": "ENGG 303",
    "title": "Engineering Economics and Project Management",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Fundamentals of engineering economics and project financials.Social and environmental design making, time value of money, cash flows, interest, equivalence, cost estimation and comparative costing, replacement analysis, capital projects, sensitivity analysis, balance sheets. Project management concepts, skills, tools and techniques including cost, scope, quality, resources, communication, risk, procurement and stakeholder management.",
    "prerequisite": "STAT 160 or STAT 289 and ECON 201"
  },
  {
    "short_name": "ENGG 401",
    "title": "Engineering Law and Professionalism",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Canadian law and professional engineering legislation topics include:  environmental law, tort liability, contracts, tenders, corporations partnerships, patents, industrial design, copyright, trademarks and code of ethics.",
    "prerequisite": " One of ENEL 400, ENEV 400, ENIN 400, ENPE 400, or ENSE 400"
  },
  {
    "short_name": "ENGG 141",
    "title": "Mechanics for EngineersDynamics",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Engineering applications of mechanical systems; kinematics and kinetics of particles and rigid bodies (such as gears, linkages and other mechanisms), free body diagram  drawing and application sin dynamics, D'Alembert's Principle, work, energy impulse, momentum. Introduction to mechanical vibrations.",
    "prerequisite": "ENGG 140 and MATH 111 (may be taken concurrently)"
  },
  {
    "short_name": "ENGG 330",
    "title": "Engineering Numerical Methods",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Application of numerical methods to engineering problems; topics includes sources and definitions of error, root finding, solutions of linear and non-linear systems of equations, regression, interpolation, numerical integration and differentiation, solution of initial value and boundary value ordinary differential equations.  Introduction to finite difference and finite element methods.  Applications include solving problems with MATLAB and ANSYS.",
    "prerequisite": " CS 110, MATH 111, MATH 122 and STAT 160 or STAT 289"
  },
  {
    "short_name": "ENGG 411",
    "title": "Safety Systems Engineering and Management\t\t",
    "faculty": "ENGG",
    "credit": "3",
    "description": "Professional engineering responsibility towards safety includes introduction to health and safety programs; workplace incident assessments; risk hazard identification (from various disciplines); risk management fundamentals; engineering-related legislation, regulations, and codes; studies of best practises and safety management. Content involves engineering design, case analysis, development and use various tools.",
    "prerequisite": "STAT 160 or STAT 289 and completion of 75 credit hours"
  },
  {
    "short_name": "MATH 110",
    "title": "Calculus I",
    "faculty": "MATH",
    "credit": "3",
    "description": "An introductory class in the theory and techniques of differentiation and integration of algebraic and trigonometric functions. Topics include limits, optimization, curve sketching, and areas.",
    "prerequisite": "Precalculus 30 with at least 75%, or Calculus 30 or Mathematics B30 and C30 with a grade of at least 65% in each or Math 102"
  },
  {
    "short_name": "MATH 122",
    "title": "Linear Algebra I",
    "faculty": "MATH",
    "credit": "3",
    "description": "A course intended to introduce students to elementary linear algebra, particularly at a computational and applied level. Topics include matrices and systems of equations, inversion, determinants, vectors, inner products, eigenvectors and eigenvalues.",
    "prerequisite": "Precalculus 30, Mathematics B30 and C30, or Math 102."
  },
  {
    "short_name": "MATH 111",
    "title": "Calculus II",
    "faculty": "MATH",
    "credit": "3",
    "description": "Differentiation and integration of exponential and logarithmic functions; methods of integration and applications; indeterminate forms, L'Hospital's rule and improper integrals; sequences, series, power series and Taylor series.",
    "prerequisite": "MATH 110, or MATH 103 with a grade of at least 80%"
  },
  {
    "short_name": "MATH 213",
    "title": "Vector Calculus",
    "faculty": "MATH",
    "credit": "3",
    "description": "A study of vector functions and functions of several variables and their derivatives; Applied maximum and minimum problems, Lagrange multipliers, multiple integration, integration in polar, cylindrical and spherical coordinates; Green's, Stokes' and the Divergence Theorem.",
    "prerequisite": "MATH 111 and 122"
  },
  {
    "short_name": "MATH 217",
    "title": "Differential Equations I",
    "faculty": "MATH",
    "credit": "3",
    "description": "Ordinary differential equations, modelling with differential equations, Laplace transforms.",
    "prerequisite": "MATH 111 and MATH 122"
  },
  {
    "short_name": "CS 110",
    "title": "Programming and Problem Solving",
    "faculty": "CS",
    "credit": "3",
    "description": "An introduction to problem-solving techniques, the fundamental concepts of programming, and the software design process. Topics will include: data types, control structures, scope rules, functions, files, and the mechanics of running, testing and debugging. Problems will be drawn from various science disciplines.",
    "prerequisite": "Precalculus 30, Calculus 30, or Math 102"
  },
  {
    "short_name": "CS 115",
    "title": "Object-Oriented Design",
    "faculty": "CS",
    "credit": "3",
    "description": "This course focuses on the concepts of object-oriented programming. Topics include data abstraction, classes, composition and inheritance, subtyping, dynamic binding, polymorphism and dynamic memory management. Other topics include type systems, two-dimensional arrays, records, references, searching and sorting algorithms, language translation. Software engineering: comprehensibility, correctness, efficiency, refactoring.",
    "prerequisite": "CS 110 with a minimum grade of 65% and one of MATH 110 (may be taken concurrently) or MATH 103 with a minimum grade of 80%."
  },
  {
    "short_name": "CS 210",
    "title": "Data Structures and Abstractions",
    "faculty": "CS",
    "credit": "3",
    "description": "This course introduces data abstraction, data structures and their implementations, the basics of algorithmic analysis, and the fundamental computing algorithms. Topics include stacks, queues, heaps, recursion, Master Theorem, asymptotic notation, computational complexity, empirical performance measurement, recursion based sorting algorithms, hashing, and trees (including binary trees, B-trees, and AVL trees).",
    "prerequisite": "CS 115 and MATH 110"
  },
  {
    "short_name": "CS 215",
    "title": "Web and Database Programming",
    "faculty": "CS",
    "credit": "3",
    "description": "This course shows how interactive database-driven web applications are designed and implemented. Appropriate protocols and languages for web and database programming will be discussed, with a focus on client-server architectures, interface design, graphics and visualization, event-driven programming, information management, data modeling, and database systems.",
    "prerequisite": "CS 210"
  },
  {
    "short_name": "CS 340",
    "title": "Advanced Data Structures and Algorithm Design",
    "faculty": "CS",
    "credit": "3",
    "description": "Fundamental algorithms: depth- and breadth-first traversals, pattern matching, and graph algorithms. Algorithmic strategies: brute-force, greedy, divide-and-conquer, backtracking, branch-and-bound, dynamic programming, and randomized. Algorithm analysis, complexity theory, performance evaluation. Parallelism: fundamentals, algorithms, communication.",
    "prerequisite": "CS 210"
  },
  {
    "short_name": "CS 205",
    "title": "Introduction to Multimedia Systems",
    "faculty": "CS",
    "credit": "3",
    "description": "Multimedia is the use of computers to integrate texts, graphics, video, animation, and sound in an interactive experience. The course introduces these elements of multimedia and their associated technologies. Students will gain an appreciation of each element and be able to combine them into a finished work.",
    "prerequisite": "CS 110"
  },
  {
    "short_name": "CS 315",
    "title": "Introduction to Computer Graphics",
    "faculty": "CS",
    "credit": "3",
    "description": "Introduction to graphics hardware and software. Two-dimensional graphics rendering algorithms. Basic three-dimensional modeling, transformations, viewing geometry, lighting and shading,  hidden surface removel, and texture mapping.",
    "prerequisite": "CS210 and MATH 122"
  },
  {
    "short_name": "CS 330",
    "title": "Introduction to Operating Systems",
    "faculty": "CS",
    "credit": "3",
    "description": "Overview of operating systems: functionality, and design issues. Operating system principles: structures, abstractions, APIs, resource allocation, proximity, virtualization. Concurrency: process state, context switches, process communication, synchronization. Scheduling: preemption, schedulers, processes, and threads. Memory management. Security and protection. File systems. User interface. Distributed algorithms: consensus, termination, and fault tolerance.",
    "prerequisite": "CS 210"
  },
  {
    "short_name": "CS 375",
    "title": "Database and Information Retrieval",
    "faculty": "CS",
    "credit": "3",
    "description": "Information management: concepts and applications. Motivation for database systems. Components of database systems. Data modeling: conceptual, spreadsheet, relational, object-oriented, and semi-structured models. Querying and database query languages. Caching and transaction processing. Other topics include distributed databases, physical database design, and information retrieval systems.",
    "prerequisite": "CS 215"
  },
  {
    "short_name": "CS 405",
    "title": "Computer Graphics",
    "faculty": "CS",
    "credit": "3",
    "description": "Advanced topics in computer graphics, including special modeling techniques for natural phenomenon, advanced illumination models and rendering algorithms.",
    "prerequisite": "CS 315"
  },
  {
    "short_name": "CS 425",
    "title": "Image Processing",
    "faculty": "CS",
    "credit": "3",
    "description": "Introduction to image processing systems.  Image transformation.  Image enhancement.  Image coding and compression.  Feature extraction and image segmentation.",
    "prerequisite": "CS 340, MATH 111 and 122"
  },
  {
    "short_name": "CS 427",
    "title": "Introduction to Computer Audio",
    "faculty": "CS",
    "credit": "3",
    "description": "The purpose of this course is to provide a broad overview of many areas of computer audio, including: Digital representation and compression; Psychoacoustics; Surround Sound; Speech recognition and Music Information Retrieval; MIDI and New interfaces for music; and video game sound. We will also explore modular interactive software environments such as Max/MSP and PD.",
    "prerequisite": "CS 315, or CS 320, or CS 340"
  },
  {
    "short_name": "CS 335",
    "title": "Computer Networks",
    "faculty": "CS",
    "credit": "3",
    "description": "Network architectures and protocols, networked applications, reliable data delivery, routing and forwarding, local area networks, resource allocation, mobility, reliability through redundancy. Security: secure design, defensive programming, threats and attacks, network security, cryptography.",
    "prerequisite": "CS 210, and STAT 160 or 200"
  },
  {
    "short_name": "CS 350",
    "title": "Programming Language Concepts",
    "faculty": "CS",
    "credit": "3",
    "description": "Programming language genealogy and design. Imperative, functional, and object-oriented language paradigms. Context-free grammars and syntax trees. Data types, control structures, exception handling, data abstraction, information hiding, and non-determinism. Program representation, translation, and execution. Functional programming: advantages, constructs, closures, and higher-order operations. Parallel programming.",
    "prerequisite": "CS 210"
  },
  {
    "short_name": "CS 372",
    "title": "Software Engineering Methodology",
    "faculty": "CS",
    "credit": "3",
    "description": "Fundamental principles of designing programs and developing large software systems that meet specifications and that are safe, secure, reliable and maintainable. Software process models, software project management, requirements engineering, software design, software construction, software verification and validation, software tools and environments, software evolution, software reliability.",
    "prerequisite": "CS 215"
  },
  {
    "short_name": "ENGL 100",
    "title": "Critical Reading and Writing I",
    "faculty": "ENGL",
    "credit": "3",
    "description": "This course develops students' proficiency in critical reading and writing through the study of a wide range of non-literary and literary texts, and the study of composition, with emphasis on connections between modes of reading and writing.",
    "prerequisite": ""
  },
  {
    "short_name": "PHYS 119",
    "title": "General Physics II",
    "faculty": "PHYS",
    "credit": "3",
    "description": "A continuation of PHYS 109: Fluid mechanics, heat and thermodynamics, waves, sound, radiation, electrostatics and electric current.",
    "prerequisite": "PHYS 109 or ENGG 140"
  },
  {
    "short_name": "PHYS 112",
    "title": "Waves and Optics",
    "faculty": "PHYS",
    "credit": "3",
    "description": "A course dealing with oscillations, wave motion, sound and geometrical and physical optics.",
    "prerequisite": "PHYS 111 (recommended) or 109 or 119, and MATH 110 (may be taken concurrently)"
  },
  {
    "short_name": "PHYS 201",
    "title": "Electricity and Magnetism",
    "faculty": "PHYS",
    "credit": "3",
    "description": "An introduction to electricity and magnetism for science and engineering students, covering the topics of electrostatics, D.C. circuits, magnetism, and electromagnetic induction.",
    "prerequisite": "MATH 213 and one of PHYS 111, 112 or 119. Math 213 may be taken concurrently."
  },
  {
    "short_name": "ENEL 280",
    "title": "Electrical Circuits",
    "faculty": "ENEL",
    "credit": "3",
    "description": "DC circuits, Kirchoff's voltage and current laws, equivalent circuits, introduction to mesh and nodal methods, superposition, maximum power transfer, capacitors,\ninductors, transient analysis of RL and RC circuits, introduction to AC steady\nstate analysis, introduction to electrical safety in engineering.",
    "prerequisite": "Math 111"
  },
  {
    "short_name": "ENEL 281",
    "title": "Signals, Circuits, and Systems",
    "faculty": "ENEL",
    "credit": "3",
    "description": "The introductory aspects of signals, circuits and systems including: AC circuit analysis,frequency response, resonance, passive and active filters, second order transient analysis, conversion between time domain and frequency domain signals using the Laplace and Fourier Transforms.",
    "prerequisite": " MATH 217 (concurrent enrolment allowed) and ENEL 280"
  },
  {
    "short_name": "ENEL 282",
    "title": "Semiconductor Devices",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Semiconductor materials and conduction principles.  The characteristics of common semiconductor devices, including: PN junction diodes, bipolar and field effect transistors, thyristors and photodiodes.  Linear models, circuit analysis and application examples.",
    "prerequisite": "ENEL 280"
  },
  {
    "short_name": "ENEL 384",
    "title": "Digital Electronics",
    "faculty": "ENEL",
    "credit": "3",
    "description": "The introductory aspects of digital electronic circuits, including basic principles of digital systems, logic function and gates, boolean algebra and combinational logic,\nintroduction to VHDL, introduction to FPGAs, combinational logic functions,\ndigital arithmetic and arithmetic circuits, introduction to sequential logic, counters\nand shift registers, and state machine design.",
    "prerequisite": "ENEL 282"
  },
  {
    "short_name": "ENEL 380",
    "title": "Automation and Control",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Programmable logic controllers, ladder logic, latches, timers, counters, flow control, and data handling instructions, sensors and actuators, state based design. Open & closed loop systems, mathematical modeling, Laplace transform, block diagrams and signal flow graphs, design and analysis of feedback systems, stability analysis, root locus, PID controllers, frequency domain technique.",
    "prerequisite": "ENIN 233 or ENEL 281 and ENEL 280"
  },
  {
    "short_name": "ENEL 387",
    "title": "Microcontroller System Design",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Design of microcontroller systems, including interfacing analog and digital circuits,\nmemory and peripheral devices, processor architecture, memory systems,\nexceptions, interrupt control, and exception programming. Students will build an\nintegrated microcontroller system in their final lab project.",
    "prerequisite": "ENSE 352 and ENEL 384"
  },
  {
    "short_name": "ENEL 487",
    "title": "Embedded and Real-Time Software Systems",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Software design practises for resource-constrained targets. Students will design and implement a number of embedded components, culminating by integrating them into a full embedded system involving aspects of feedback control, signal processing, or communications. Topics: Architectures for real-time systems. Fundamentals of real-time operating systems. Software design. Interfacing and communications. Speed, memory, and power performance tradeoffs. Testing. Dependability.",
    "prerequisite": "ENEL 387 and CS 210"
  },
  {
    "short_name": "ENEL 489",
    "title": "FPGA Design Using VHDL",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Introduction to FPGA digital system design. Students will learn a high-level hardware design language (VHDL), the concurrent and sequential statements of VHDL, the principle and practice of combinational circuit design, the principle and practice of sequential circuit design, Finite State Machine, Register Transfer Methodology, the synthesis and implementation of digital design on a FPGA device. Advanced synchronous digital design 3 techniques such as pipelining, parallelism, and caching. Students will develop a design and test it on an FPGA development board.",
    "prerequisite": "ENEL 384"
  },
  {
    "short_name": "ENEL 389",
    "title": "Control Systems",
    "faculty": "ENEL",
    "credit": "3",
    "description": "This course extends student knowledge of continuous-time domain control systems. Topics include: a detailed examination of system response to various inputs, mechanisms to limit disturbance effects, use of root locus plotting to determine system gains for stability, system design to limit transient response (over-shoot, rise-time, settling-time), state-space representation of systems, multi-input/ multi-output system analysis, state-space based design.",
    "prerequisite": "ENEL 380"
  },
  {
    "short_name": "ENEL 484",
    "title": "Digital Control System Design",
    "faculty": "ENEL",
    "credit": "3",
    "description": "This course is an introduction to digital control systems. Topics include: representing digital systems in the z-domain, difference equation representation of discrete-time systems, root locus plotting of discrete-time systems on the z-plane, discrete-time PID control, mapping between continuous-time systems and discrete-time systems, design using transform and state space methods, pure digital design, dead-beat systems.",
    "prerequisite": "ENEL 389"
  },
  {
    "short_name": "ENEL 383",
    "title": "Analog System Design",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Application of electronic components and systems.  Topics include load control through active components, operational amplifier applications in amplifier, decision making and filtering applications.  Switched mode and linear voltage regulation, power supply components, systems and safety, low frequency amplification.  Concepts are presented in a design rich environment.",
    "prerequisite": " ENEL 282 and ENEL 281"
  },
  {
    "short_name": "ENEL 390",
    "title": "Communication Theory",
    "faculty": "ENEL",
    "credit": "3",
    "description": "An introduction to information theory and telecommunication signals and methods.  Definition of information, time to frequency relations, application of Fourier series and the Fourier transform, types of modulation, theory of discrete sampling and the Nyquist sampling rate.",
    "prerequisite": "ENEL 281 and MATH 217"
  },
  {
    "short_name": "ENEL 371",
    "title": "Power and Energy I",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Introduction to concepts of power systems including: single and three phase\nAC power, delta-wye transformations transformers, per-unit system, transmission lines, introduction to synchronous machines, induction motors and safety in electrical systems.",
    "prerequisite": "ENEL 281 and PHYS 201 or Permission of ESE Program Chair."
  },
  {
    "short_name": "ENEL 400",
    "title": "ESE Project Start-up",
    "faculty": "ENEL",
    "credit": "1",
    "description": "The main purpose of this course is to prepare students for their project design course, ENEL 417. Students form design teams. The teams will propose, develop, & present engineering design projects that they will pursue in ENEL 417. In addition, each project group will orally present their proposal to their colleagues. Issues of safety, feasibility, & engineering responsibility, will be considered in this course.",
    "prerequisite": "ENEL 371, ENEL 390, ENEL 380 and ENEL 387 and successful completion of 99 credit hours or permission of ESE Program Chair"
  },
  {
    "short_name": "ENEL 417",
    "title": "ESE Design Project",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Typically, a functional device or system, incorporating electronic hardware and/or software in a team design, is to be designed, implemented, and tested.  A formal written report, a demonstration of the project and an oral presentation of the work are required.",
    "prerequisite": "ENEL 400 and ENEL 387"
  },
  {
    "short_name": "ENEL 393",
    "title": "Digital Communications",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Error rates, optimum decision levels, statistical decision theory, matched filters, narrowband noise, system performance, optimum binary transmission, M-ary orthogonal signals, Shannon capacity expression, coding for error detection and correction, repeater systems.",
    "prerequisite": "ENEL 390"
  },
  {
    "short_name": "ENEL 395",
    "title": "Transmission Lines and Antennas",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Review of transmission line fundamentals, Smith charts, matching techniques, microstrip transmission lines, place waves, antenna fundamentals, and RF propagation.",
    "prerequisite": "ENEL 281 and PHYS 201 or Permission of ESE Program Chair"
  },
  {
    "short_name": "ENEL 472",
    "title": "Power Systems Fundamentals",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Single and three phase machines, induction machine starting and protection circuits, transformer characteristics, fault current determination, per unit system and symmetrical components, industrial and utility protective devices, and\nintroduction to load flow.",
    "prerequisite": "ENEL 371"
  },
  {
    "short_name": "ENEL 482",
    "title": "Power Systems",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Application of concepts to power delivery and industrial use.  Topics include power system stability/power quality, power system specification, and analysis/design.  Course involves at least one design Project.",
    "prerequisite": " ENEL 472"
  },
  {
    "short_name": "ENEL 495",
    "title": "Digital Signal Processing",
    "faculty": "ENEL",
    "credit": "3",
    "description": "Representation of signals and systems, Fourier analysis, timefrequency spectrum, sampling and reconstruction of signals, aliasing, linearity and time-invariance, convolution, FIR filters, IIR filters, Z-transform, design and analysis of FIR and IIR filters, spectrum analysis using DFT/FFT, adaptive filters, simulation of DSP concepts using MATLAB/SIMULINK, hardware implementation of DSP applications.",
    "prerequisite": "ENEL 390"
  },
  {
    "short_name": "ENEV 422",
    "title": "Solid and Hazardous Waste Management",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Legislative trends; sources and characteristics of municipal solid waste; Recycling waste materials; Collection, transfer and transport; Disposal options; Sanitary landfill, incineration, composting and bioconversion; Management and Planning; Hazardous Waste-Problems, impacts and treatment/ disposal.",
    "prerequisite": "ENEV 223"
  },
  {
    "short_name": "ENEV 223",
    "title": "Engineering, Environment, and Society",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Introduction and application of environmental design in engineering practice, including public health and safety, environmental ethics, resource and energy systems, impacts of technology on society, sustainable development and environmental stewardship.",
    "prerequisite": "ENGG 123"
  },
  {
    "short_name": "ENEV 261",
    "title": "Engineering Fluid Mechanics",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Properties of fluids, pressure and fluid statics, mass, energy and momentum principles, Bernoulli and energy equations, steady state internal flow in pipe systems, flow measurement, external flow drag and lift, dimensional analysis.",
    "prerequisite": " ENGG 141 (or ENGG 240) and PHYS 199 (or PHYS 109) and completion of 45 Credit Hours."
  },
  {
    "short_name": "ENEV 372",
    "title": "Transportation Systems",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Introduction to transportation as a system; roles of transportation in society; the technology of transportation; the transportation system and its environment; introduction to planning and management of regional transportation facilities.",
    "prerequisite": "CS 110 and ENGG 240 or ENGG 141 (concurrent enrolment is allowed)"
  },
  {
    "short_name": "ENEV 321",
    "title": "Applied Environmental Science",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Study of biochemical effects of human activities on the environment; ecology and environmental pollution; materials and energy balances; chemical systems; basic concepts of aquatic and soil chemistry; water resources; transport phenomena; water pollution; human health risk assessment; water quality and treatment; wastewater treatment; public health aspects.",
    "prerequisite": "CHEM 104"
  },
  {
    "short_name": "ENEV 281",
    "title": "Surveying, Mapping and Information Systems",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Fundamental principles and methods of surveying fieldwork and computations. Concurrent lectures, fieldwork, and office work. Spatial information systems.",
    "prerequisite": " ENGG 123"
  },
  {
    "short_name": "ENEV 334",
    "title": "Simulation & Decision Making for Engineers",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Simulation and decision making for environmental engineering systems and problems such as contamination, floods, and traffic. Topics include numerical methods, distributions, regression, hypothesis testing, modelling, and risk analyses.",
    "prerequisite": "STAT 160 or STAT 289"
  },
  {
    "short_name": "ENEV 384",
    "title": "Engineering Materials",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Structure and properties of engineering materials, particularly steel, aggregate, and asphalt and Portland cement concretes. Introduction to soils. Environmental aspects of materials.",
    "prerequisite": "CHEM 104"
  },
  {
    "short_name": "ENEV 480",
    "title": "Terrain and Site Analysis",
    "faculty": "ENEV",
    "credit": "3",
    "description": "The application of airphoto, satellite imagery and geomorphological interpretation to regional engineering problems, to management of resources, and to monitoring of the environment. On-site investigation techniques.",
    "prerequisite": "GEOL 102"
  },
  {
    "short_name": "ENEV 360",
    "title": "Environmental Hydraulics",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Momentum, mass and energy balances in the design, synthesis and analysis of flow in pipes, open channels and porous media ; pumps; turbines; dams; spillways; culverts; diversion, conveyance and control structures.",
    "prerequisite": "ENEV 261"
  },
  {
    "short_name": "ENEV 421",
    "title": "Environmental Design and Impact",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Environmental factors and their assessment with particular reference to engineering projects.  Topics include mitigation measures and standards.",
    "prerequisite": "ENEV 321"
  },
  {
    "short_name": "ENEV 440",
    "title": "Air Pollution Engineering",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Air pollution effects and control regulations, atmospheric chemistry, air quality detection, pollution meteorology, air quality, modeling, air pollution control, techniques, and global atmospheric problems.",
    "prerequisite": "ENEV 321"
  },
  {
    "short_name": "ENEV 462",
    "title": "Engineering Hydrology",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Introductory engineering hydrology course. Topics include rainfall, snowmelt, infiltration, evaporation, streamflow, flood frequency analysis, flood routing, and runoff modeling.",
    "prerequisite": " ENEV 261 and CS 110"
  },
  {
    "short_name": "ENEV 363",
    "title": "Water and Wastewater Engineering",
    "faculty": "ENEV",
    "credit": "3",
    "description": "The theory and design of systems and system components used in water treatment and distribution and in wastewater collection and treatment.",
    "prerequisite": "ENEV 321"
  },
  {
    "short_name": "ENEV 383",
    "title": "Geotechnical Engineering",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Soil properties, water movement and seepage, stress distribution in soil masses, consolidation and settlement, lateral shear stress, slope stability analysis, shallow foundation design and retaining wall design.  Emphasis will be on the environmental problems with the soil.",
    "prerequisite": "ENIN 241 and ENEV 384"
  },
  {
    "short_name": "ENEV 400",
    "title": "EVSE Project Start-up",
    "faculty": "ENEV",
    "credit": "1",
    "description": "In this course a team design project for ENEV 415 is selected, preliminary project information gathered, and a project plan prepared.  Students are advised to coordinate the chosen project topic with their approved electives in order to be better prepared for the completion of their ENEV 415 project.",
    "prerequisite": "ENEV 321, ENEV 440 and successful completion of 99 credit hours or permission of EVSE Program Chair."
  },
  {
    "short_name": "ENEV 435",
    "title": "Engineering Project Management",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Fundamentals of project management in an engineering environment. Support functions of time management and conflict resolution. Performance management. Project planning, scheduling and cost control. Contracts, warranties and liabilities. Special topics.",
    "prerequisite": "ENEV 334"
  },
  {
    "short_name": "ENEV 415",
    "title": "Environmental Systems Engineering Design Project and Communications",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Preparation and presentation of a report on an approved systems engineering design project.  Basics of preparing and presenting engineering reports.",
    "prerequisite": "ENEV 400"
  },
  {
    "short_name": "ENEV 469",
    "title": "Groundwater Development & Contaminant Transport",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Basic principles of fluid flow in saturated and unsaturated materials, well problems, groundwater quality, discussion of salt water intrusion, and modeling of groundwater flow and contaminant transport.",
    "prerequisite": " ENEV 462 and ENEV 383.  Concurrent enrolment allowed in ENEV 462"
  },
  {
    "short_name": "ENEV 408",
    "title": "Basic Structural Design",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Design concepts and practices for simple beams, columns, connectors and structures in wood, steel and reinforced concrete. Basic types and problems in design of foundations.",
    "prerequisite": "ENIN 241, ENGG 240 or ENGG 141 and ENEV 384"
  },
  {
    "short_name": "ENEV 445",
    "title": "Advanced Air Pollution Enginee",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Principles of process design and cost estimation for air pollution control, design and operation of auxilliary equipment for transport and cooling waste gas streams, control of carbon dioxide, indoor air quality and control strategy.",
    "prerequisite": "ENEV 440 and ENIN 253"
  },
  {
    "short_name": "ENEV 463",
    "title": "Water Resources Systems",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Water resources planning and management. Topics include planning for hydroelectric, flood control, water supply and irrigation projects; stochastic processes; synthetic streamflow generation; simulation and optimization of water resource systems.",
    "prerequisite": "ENEV 462"
  },
  {
    "short_name": "ENEV 475",
    "title": "Traffic Engineering",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Study of the characteristics of traffic flow and methods of traffic control; introduction to traffic flow and queuing theory; roadway capacity and level of service analysis; speed and volume studies; traffic signs and signalization; computer control systems; and, accident analysis.",
    "prerequisite": "ENEV 372"
  },
  {
    "short_name": "ENEV 484",
    "title": "Highway Design",
    "faculty": "ENEV",
    "credit": "3",
    "description": "Detailed geometric design of highways; functional and detailed geometric design of at-grade and grade separated intersections; and, introduction to design of flexible and rigid pavements.",
    "prerequisite": "ENEV 281, 372, and 384"
  },
  {
    "short_name": "STAT 289",
    "title": "Statistics for Engineers",
    "faculty": "STAT",
    "credit": "3",
    "description": "Topics include probability, discrete and continuous distributions, the central limit theorem, confidence intervals and hypothesis tests for one and two samples, linear regression and correlation.",
    "prerequisite": "MATH 111"
  },
  {
    "short_name": "ENSE 352",
    "title": "Fundamentals of Computer Systems Architectures",
    "faculty": "ENSE",
    "credit": "3",
    "description": "The course aims at providing the basic understanding of computer architecture.  Topics include handheld device architecture, operating systems, component software design, and concurrent processing.   Students are introduced to software concepts such as threading, remote procedure calls, multitasking, deadlocks, and concurrency.",
    "prerequisite": "CS 210 and ENEL 384 (concurrent enrollment is allowed)"
  },
  {
    "short_name": "ENSE 374",
    "title": "Software Engineering Management",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Principles of software engineering: requirements, design and testing. Review of principles of object orientation. Object oriented analysis using UML. Frameworks and APIs. Introduction to the client-server architecture. Analysis, design and programming of simple servers and clients. Introduction to user interface technology.",
    "prerequisite": "CS 210"
  },
  {
    "short_name": "ENSE 353",
    "title": "Software Design and Architecture",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Modeling and design of flexible software at the architectural level. Basics of model-driven architecture. Architectural styles and patterns. Middleware and application frameworks. Configurations and configuration management. Product lines. Design using Commercial Off-The-Shelf (COTS) software.",
    "prerequisite": "CS 215"
  },
  {
    "short_name": "ENSE 400",
    "title": "ENSE Project Start-up",
    "faculty": "ENSE",
    "credit": "1",
    "description": "Students are given the opportunity to propose, develop and present engineering design projects which they are expected to further pursue in ENSE 477.  Issues of safety, feasibility, and engineering responsibility are discussed.  Student form design teams in this class and are expected to write a project plan document, compose a preliminary design document, and present their project to their fellow students.",
    "prerequisite": "ENSE 470 and successful completion of 99 credit hours"
  },
  {
    "short_name": "ENSE 472",
    "title": "Digital Networks",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Introduction to information theory; network architectures and LAN implementation/configuration; network administration principles; communication protocols (i.e. TCP/IP stack );   internet applications, wireless networks, physical lines (i.e. fibre, twisted pair, coax), network performance, troubleshooting and system security.",
    "prerequisite": "CS 215"
  },
  {
    "short_name": "ENSE 350",
    "title": "Mathematical Programming for Software Engineers",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Fundamental concepts of discrete mathematics (definitions, proofs, sets), discrete structures (graphs, state machines, modular arithmetic), algorithm complexity models, and numerical methods in engineering.",
    "prerequisite": "Math 110, 122 and CS 210"
  },
  {
    "short_name": "ENSE 477",
    "title": "Software Systems Engineering Design Project",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Development of significant software system, employing knowledge gained from courses throughout the program. This includes development of requirements, design, implementation, and quality assurance. Students follow a suitable process model and manage the project themselves, following appropriate project management techniques.",
    "prerequisite": "ENSE 400 and ENSE 470"
  },
  {
    "short_name": "ENSE 474",
    "title": "Software Process Management",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Software processes: standards, implementation, and assurance. Project management with a focus on requirements management and long-term evolution: Eliciting and prioritizing requirements, cost estimation, planning and tracking projects, risk analysis, project control, change management.",
    "prerequisite": "ENSE 374"
  },
  {
    "short_name": "ENSE 479",
    "title": "Engineering Concepts in Sound Art",
    "faculty": "ENSE",
    "credit": "3",
    "description": "This course introduces the artistic practice and engineering design concepts within sound art. It covers a range of sound art practices including avant-garde sound, Musique Concrete, sound and 1960s art movements, electroacoustic music, sound sculpture, radio art, Acoustic Ecology, community-engaged sound art, sound art in performance, and engineering design concepts of new media.",
    "prerequisite": " Successful completion of 30 credit hours or permission of Program Chair"
  },
  {
    "short_name": "ENSE 480",
    "title": "Knowledge Base and Information Systems",
    "faculty": "ENSE",
    "credit": "3",
    "description": "This course analyzes the fundamentals of industrial knowledge management. Students will learn how to analyze a company and how to produce an information system.  Topics include the fundamentals of Knowledge Base Management Information Systems and their impact on the business process, engineering an information system, Workflow Management Design, and reengineering for change management.",
    "prerequisite": " ENSE 353 or completion of 81 SSE program related credit hours or permission of Program Chair"
  },
  {
    "short_name": "ENSE 481",
    "title": "Embedded Systems and Co-design",
    "faculty": "ENSE",
    "credit": "3",
    "description": "Embedded systems are increasingly common in modern systems design.  This course will teach students how to take advantage of embedded systems technology in their system designs.  Topics include: advanced microcontroller real-time design, co-design, embedded systems design issues, power considerations, and wireless considerations.",
    "prerequisite": "ENEL 387 and ENEL 487"
  },
  {
    "short_name": "ENSE 482",
    "title": "New Media Technology",
    "faculty": "ENSE",
    "credit": "3",
    "description": "This course aims to provide a basic level of understanding to make it possible for engineers to work with designers and understand some of the constraints within New Media design.  Topics include: definition of New Media, New Media narratives, Multimedia, integration, intermedia, the basic tools, and New Media design.",
    "prerequisite": "ENSE 374"
  },
  {
    "short_name": "ENSE 483",
    "title": "Digital Wireless Systems",
    "faculty": "ENSE",
    "credit": "3",
    "description": "This course provides the skills necessary to understand and use systems from the point of view of protocol, bandwidth, and spectrum allocation.  Topics include spectrum allocation, digital modulation, spread-spectrum communications fundamentals, digital radio protocols for modern wireless systems, working with CDPD, Bluetooth, and IEE 802.11a/b, interference and collision.",
    "prerequisite": "ENSE 374"
  },
  {
    "short_name": "BUS 260",
    "title": "Introduction to Organizational Behaviour",
    "faculty": "BUS",
    "credit": "3",
    "description": "This introductory course addresses the basic concepts and processes of organizational behaviour. Topics will include:  individual level variables, such as perception, personality, attitudes, and motivation; interpersonal and group processes, such as communication, teams, leadership, and power; and, organizational level factors such as organizational design, culture, and change.",
    "prerequisite": "ENGL 100, or ACAD 100, or KIN 101."
  },
  {
    "short_name": "BUS 250",
    "title": "Introduction to Human Resource Management and Industrial Relations",
    "faculty": "BUS",
    "credit": "3",
    "description": "This introductory course addresses basic concepts and processes of the field of human resource management. Topics include: human resource planning, job analysis, recruitment, selection, orientation, training and development, performance management, compensation management, workplace health and safety, and employee and labour relations.",
    "prerequisite": "BUS 100 (or ADMN 100) and BUS 260 (or ADMN 260)."
  },
  {
    "short_name": "BUS 210",
    "title": "Introduction to Marketing",
    "faculty": "BUS",
    "credit": "3",
    "description": "This course presents the fundamentals of marketing theory and application. Starting at a societal level, it works through environmental scanning, explores the differences between consumer and business customer groups, followed with a strategic focus on segmentation, targeting and positioning. Tactical applications of the marketing mix are then addressed – product, price, place and promotion. Attention is also directed to ethical and legal considerations.",
    "prerequisite": "BUS 100 (or ADMN 100) and BUS 260 (or ADMN 260). Concurrent enrolment is allowed in BUS 260."
  },
  {
    "short_name": "BUS 302",
    "title": "Entrepreneurship: Small Business Modeling and Feasibility Analysis",
    "faculty": "BUS",
    "credit": "3",
    "description": "This course addresses early stage elements of starting up and operating a small business on a conceptual level. Using cases, competitions and experiential exercises, students will learn opportunity alertness and identification, building a value proposition, testing business hypotheses, creating competitive advantage, setting up financials, analyzing break even, charting growth and planning for exit. Students develop, build and test an entrepreneurial opportunity they identify, and assess its feasibility. The course applies to all business start up including non profit, for profit, for benefit and corporate or institutional intrapreneurship.",
    "prerequisite": "Completion of a minimum of 30 credit hours of university studies."
  },
  {
    "short_name": "ECON 201",
    "title": "Introductory Microeconomics",
    "faculty": "ECON",
    "credit": "3",
    "description": "Theory of how individual consumers and firms behave in a market economy. Emphasis is on evaluating how well markets deliver efficient and fair outcomes.",
    "prerequisite": "15 credit hours or ECON 100 or Pre-Calculus 20 (or equivalent)"
  },
  {
    "short_name": "ENPE 241",
    "title": "Introduction to Petroleum Engineering",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Exposure to various disciplines within petroleum engineering including drilling, production, and reservoir engineering; professionalism and ethics in petroleum engineering.",
    "prerequisite": " GEOL 102"
  },
  {
    "short_name": "ENPE 251",
    "title": "Reservoir Fluid Properties",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Qualitative and quantitative phase behavior of petroleum reservoir fluids through the algebraic and numerical application of thermodynamic theory, equations of state, and empirical correlations; determination of engineering PVT parameters; and, phase behaviour of hydrocarbon systems.",
    "prerequisite": "MATH 217 (concurrent enrolment allowed)"
  },
  {
    "short_name": "ENPE 300",
    "title": "Fundamentals of Reservoir Engineering",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Relationship of geology, basic reservoir properties, surface and interfacial phenomena, and the flow of fluids through porous media; general material balance, steady state, and transient models; classification of petroleum reservoirs, displacement of oil and gas, and reservoir estimation principles.",
    "prerequisite": "ENPE 241 and 251"
  },
  {
    "short_name": "ENPE 360",
    "title": "Drilling Engineering",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Drilling fluids, rotary drilling, drilling hydraulics, formation  pore pressure and fracture resistance, casing design, directional drilling, horizontal drilling and drilling waster disposal.",
    "prerequisite": "ENPE 300 and ENEV 261 (concurrent enrollment allowed for both)"
  },
  {
    "short_name": "ENPE 302",
    "title": "Applied Reservoir Engineering",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Analysis and prediction of reservoir performance by use of material balance. Reservoir performance by use of decline curves.  Pressure maintenance, oil trapping, capillary number correlations, fluid displacement, fractional flow, displacement efficiency, areal and vertical sweep efficiencies, waterflooding design, and gas injections.",
    "prerequisite": "ENPE 300"
  },
  {
    "short_name": "ENPE 370",
    "title": "Petroleum Production Operations",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Principles of oil and gas production. Artificial lift, inflow performance relationships, introduction to well stimulation, and production system design.",
    "prerequisite": "ENPE 300 and ENEV 261"
  },
  {
    "short_name": "ENPE 400",
    "title": "PSE Project Start-up",
    "faculty": "ENPE",
    "credit": "1",
    "description": "Definition of petroleum engineering design problems; identification of projects' topics, partners, and supervisors; proposal writing for engineering projects; approaches for carrying out the research and design; and, approaches for communicating research and design results.",
    "prerequisite": "Completion of all the required 200 and 300 level ENPE courses and successful completion of 99 credit hours"
  },
  {
    "short_name": "ENPE 410",
    "title": "Enhanced Oil Recovery Methods",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Displacement processes for recovering additional hydrocarbons.  Waterflooding, gas flooding, solvent flooding, and thermal recovery processes.  Development of design techniques.",
    "prerequisite": "ENPE 302"
  },
  {
    "short_name": "ENPE 440",
    "title": "Well Logging and Formation Evaluation",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Fundamentals of well logging for the determination of petrophysical properties in the near bore region, types of well logging devices, and applications of well logs for petroleum system management.",
    "prerequisite": "ENPE 241 and ENPE 360 (may be taken concurrently)"
  },
  {
    "short_name": "ENPE 450",
    "title": "Well Testing",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Basic principles of well testing and interpretation for oil and gas production, pressure transient theory, principles of superposition, and application of well testing to homogeneous and heterogeneous reservoirs.",
    "prerequisite": "ENPE 300 and ENPE 360 (may be taken concurrently)"
  },
  {
    "short_name": "ENPE 419",
    "title": "PSE Design Project and Communications",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Student's team design project is to be completed in an acceptable written and oral report form.  Instructions will be given on the preparation and presentation of the engineering report related to the petroleum industry.",
    "prerequisite": " ENPE 400"
  },
  {
    "short_name": "ENPE 486",
    "title": "Heavy Oil Recovery",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Thermal Recovery Methods, theory and practice of thermal recovery methods; steam drive, cyclic steam injections, and insitu combustion.  Models of combined mass energy transport.  Estimates of heated reservoir volume and oil recovery performance.  Wellbore heat losses and recovery production.",
    "prerequisite": "ENPE 302, 370 and ENIN 355"
  },
  {
    "short_name": "ENPE 340",
    "title": "Rock Mechanics",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Stress and strain tensors, rock elasticity, mechanical properties of rocks, effective stress concept, anisotropy, time-dependent effects, constitutive modeling of rocks, failure mechanics, rock properties from laboratory experiments, rock properties from from field data.",
    "prerequisite": "ENGG 240 and ENPE 300"
  },
  {
    "short_name": "ENPE 380",
    "title": "Petroleum Treating Operations",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Petroleum treating processes.  Multiphase Seperation equipment design and operations; hydrocyclones, desalination, dehydration, hydrate, prevention, emulsion treating, and viscosity altering processes.",
    "prerequisite": "ENIN 355"
  },
  {
    "short_name": "ENPE 435",
    "title": "Reservoir Stimulation",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Formation damage mechanisms, introduction to reservoir stimulation techniques, matrix acidizing operation design, sandstone acidizing, carbonate acidizing, placement and diversion methods, introduction to rock mechanics, acid fracturing operations, hydraulic fracturing operations, fracture treatment design, treatment analysis and post-treatment evaluation.",
    "prerequisite": "ENPE 370"
  },
  {
    "short_name": "ENPE 448",
    "title": "Reservoir Characterization",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Review petroleum reservoir geology, geological depositional environments, petrophysical and geostatistical analysis, and reserves estimation based on static and dynamic reservoir information.  Emphasis on data analysis and integration for a model suitable for reservoir simulation.",
    "prerequisite": "ENPE 440 (may be taken concurrently)"
  },
  {
    "short_name": "ENPE 470",
    "title": "Reservoir Modelling",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Fundamentals of modeling in petroleum engineering.  Simulation methods as applied to specific problems in petroleum reservoir behavior; examples will be drawn from primary, secondary, and tertiary recovery phases of petroleum production.",
    "prerequisite": "ENPE 410 (concurrent enrolment is allowed) and ENGG 330"
  },
  {
    "short_name": "ENPE 475",
    "title": "Evaluation of Oil and Gas Properties",
    "faculty": "ENPE",
    "credit": "3",
    "description": "General business skills related to the understanding of oil field cash flow projections, rate of return, royalties, taxes and other factors in measuring value creation as it relates to the petroleum industry.",
    "prerequisite": " ENPE 302, ENPE 440 and ENGG 303"
  },
  {
    "short_name": "ENPE 490",
    "title": "Petroleum Waste Management",
    "faculty": "ENPE",
    "credit": "3",
    "description": "Prevention and mitigation techniques in pipeline and oil field spills.  Downhole disposal of waste fluids, surface disposal of oil field wastes, fire and other hazards, H2S and other toxic gases, and safety standards.",
    "prerequisite": " ENPE 300 or ENEV 320 or ENEV 223"
  },
  {
    "short_name": "ENPE 491",
    "title": "Carbon Capture, Utilization and Geo-sequestration",
    "faculty": "ENPE",
    "credit": "3",
    "description": "This course will cover global climate change impacts,  sources of greenhouse gas emissions, as well as the benefits and applications of carbon capture technologies for the petroleum industry, sequestration in oil and gas reservoirs and deep saline aquifers. Additionally, CCS policies and regulatory development will be explored.",
    "prerequisite": "ENPE 300 and ENIN 355"
  },
  {
    "short_name": "ENPE 492",
    "title": "Introduction to Petroleum Refinery",
    "faculty": "ENPE",
    "credit": "3",
    "description": "In this course students will become familiar with the basic principles of petroleum refinary operations. Composition of crude oils, related laboratory tests and refinery feedstocks and products will be discussed. Evaluation of crude oil properties and design of distillation columns, furnace, thermal and catalytic cracking, catalytic reforming, hydrotreating, hydrocracking, isomerization, alkylation and polymerization will be introduced.",
    "prerequisite": "ENIN 355"
  },
  {
    "short_name": "GEOL 102",
    "title": "Environmental Geology",
    "faculty": "GEOL",
    "credit": "3",
    "description": "The nature of the earth.  Plate tectonics and the geological time scale.  Earthquakes, volcanism and surface processes with reference to their effect on the human environment. Earth resources, waste disposal, and pollution in a geological context.",
    "prerequisite": ""
  },
  {
    "short_name": "GEOL 270",
    "title": "Earth Resources and the Environment",
    "faculty": "GEOL",
    "credit": "3",
    "description": "An intermediate course focused on origin, global distribution, use and environmental impact of earth resources, metallic minerals, energy resources, industrial minerals, and the social, economic and political implications of mineral resources.",
    "prerequisite": "GEOL 102"
  },
  {
    "short_name": "ENIN 233",
    "title": "System Dynamics",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Lumped parameter linear analysis methods for mechanical, electrical, fluid and thermal systems.  Linear differential equations to analyze system response to step and sinusoidal forcing functions.  Analogous nature of these systems.",
    "prerequisite": " MATH 217"
  },
  {
    "short_name": "ENIN 253",
    "title": "Engineering Thermodynamics",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Fundamental laws of thermodynamics and their application to various engineering systems. Ideal and actual processes, power and refrigeration cycles.",
    "prerequisite": "PHYS 119"
  },
  {
    "short_name": "ENIN 350",
    "title": "Chemical Manufacturing Process",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Mass and energy balances in chemical process industries. Applications including the petrochemical, pulp and paper, and mining industries.  Environmental problems, thermodynamics, stoichiometry, chemical reactions, and computer applications.",
    "prerequisite": "CHEM 104 and ENIN 253 (concurrent enrolment is allowed)"
  },
  {
    "short_name": "ENIN 355",
    "title": "Heat Mass and Momentum Transfer",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Differential equations of momentum, heat and mass transfer; dimensional analysis; heat conduction and convection; boiling and condensation; molecular diffusion; convective mass transfer; and, analogies between momentum, heat and mass transfer.",
    "prerequisite": " ENEV 261 and ENIN 350"
  },
  {
    "short_name": "ENIN 433",
    "title": "Risk Assessment and Decision Analysis",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Probability of failure, hazards analysis, human reliability, reliability assessment, event tree and fault tree analysis and risk-based decision-making; decision consideration, inspection, testing and maintenance for critical components.",
    "prerequisite": "STAT 160 or STAT 289 and MATH 217"
  },
  {
    "short_name": "ENIN 453",
    "title": "Mechanical Systems Equipment",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Design, operation, and application characteristics of service equipment commonly used in manufacturing and process plant operations and facilities.  Topics include compressors, pumps, piping systems, valves, hydraulic systems, fans, and heat exchangers.",
    "prerequisite": " ENIN 253 and ENEV 261"
  },
  {
    "short_name": "ENIN 456",
    "title": "Process Unit Operations and Design",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Principles and equipment design for momentum, heat, and mass transfer operations in industries such as petrochemical and refining, mining and mineral processing, pulp and paper, and food processing.",
    "prerequisite": " ENIN 355"
  },
  {
    "short_name": "ENIN 241",
    "title": "Mechanics of Deformable Solids",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Introductory mechanics of materials, stresses and strains in two dimensions, torsion, indeterminate systems, beams - stresses and deflection, combined stresses, thin shells, columns, and Mohr's circle for stress and strain.",
    "prerequisite": "ENGG 240 or ENGG 141 and MATH 111"
  },
  {
    "short_name": "ENIN 331",
    "title": "Simulation of Industrial Systems",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Engineering approaches to model building and simulation of continuous and discrete systems.  Simulation languages.  Numerical methods in continuous systems modeling.  Case studies in discrete systems simulation.",
    "prerequisite": "STAT 160 or STAT 289"
  },
  {
    "short_name": "ENIN 343",
    "title": "Manufacturing Processes and Machinery",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Manufacturing processes, methods, and related equipment.  Foundry, heat treatment, and welding.  Operational characteristics of manufacturing and manufacturing support machinery and equipment.  Basic structure and properties of metals.",
    "prerequisite": "ENIN 241"
  },
  {
    "short_name": "ENIN 430",
    "title": "Systems Management",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Approaches to management and optimization through problem identification, formulation, and qualitative and quantitative solutions.",
    "prerequisite": "ENIN 331 or completion of at least 66 credit hours or permission of the Program Chair"
  },
  {
    "short_name": "ENIN 440",
    "title": "Statistical Quality Control",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Assessment and control of manufacturing processes using control charts.  Quality inspection using acceptance sampling plans.  Statistical tolerancing and process capability studies.",
    "prerequisite": "STAT 289 (or STAT 160) and successful completion of 60 credit hours"
  },
  {
    "short_name": "ENIN 340",
    "title": "Human Factors Engineering",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Anatomical, physiological, and psychological aspects of people in their work environment.  Sensory processes and motor function, health, and morale.  Social factors, stress, and psychosomatic effects.  Work standards, safety, and schedules.",
    "prerequisite": " ENIN 233 and ENIN 241"
  },
  {
    "short_name": "ENIN 349",
    "title": "Industrial Machine Design",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Machine design problems using analysis and codes.  Machines components and meshing components to achieve machine function.  Elementary stress analysis of equipment configuration.  Tolerances and allowances.  Design drawings.",
    "prerequisite": "ENIN 241 and ENIN 343"
  },
  {
    "short_name": "ENIN 400",
    "title": "ISE Project Start-up",
    "faculty": "ENIN",
    "credit": "1",
    "description": "Students form design teams and select a project topic and faculty supervisor.  Each team develops a project proposal, which is presented both orally and in written form.",
    "prerequisite": "ENIN 453, ENIN 349 (concurrent enrolment allowed) and successful completion of 99 credit hours or permission of the Program Chair"
  },
  {
    "short_name": "ENIN 444",
    "title": "Computer-Aided Engineering",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Computerized design aids, finite element analysis, design verification, simulation and testing.  Control fundamentals as applied to numerical control machine systems. Specification, design, implementation and documentation of a design system.  Robotics.",
    "prerequisite": " CS 110 and ENIN 349.  Concurrent enrolment allowed in ENIN 349."
  },
  {
    "short_name": "ENIN 413",
    "title": "ISE Team Design Project and Communications",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Student's team design project is to be completed, written in acceptable report form and presented.  Instruction will be given on the preparation and presentation of engineering reports in various audio/visual media.",
    "prerequisite": " ENIN 400 (taken within same academic year)"
  },
  {
    "short_name": "ENIN 370",
    "title": "Introduction to Mechatronics",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Introduction to mechatronics; sensors and transducers, signal conditioning, mechanical and electrical actuation systems.  Control of DC/servo motors using Pulse Width Modulation; system modeling, dynamic response of systems, closed-loop controllers, microcontrollers, digital logic, and programmable logic controllers.",
    "prerequisite": " ENEL 280 and ENEL 380"
  },
  {
    "short_name": "ENIN 445",
    "title": "Computer Integrated Manufacturing",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Components of computer-integrated manufacturing systems.  Numerical controlled machines.  Robot technology, group technology, and flexible manufacturing systems.  Computer-aided process planning, inspection and quality control, and automated storage and retrieval systems.",
    "prerequisite": "ENIN 343"
  },
  {
    "short_name": "ENIN 448",
    "title": "Facilities Planning and Design",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Approaches to establishing location and layout of space, equipment, and services for industrial facilities.  Criteria and data for generating alternatives.  Material handling, flow, and balance.  Environmental, human, and cost consideration.",
    "prerequisite": "ENIN 343"
  },
  {
    "short_name": "ENIN 455",
    "title": "Energy Systems",
    "faculty": "ENIN",
    "credit": "3",
    "description": "Examination of a variety of existing and potential systems involving production, consumption, and environmental impact of chemical, electrical, and mechanical energy.  Energy systems.  Heat transfer and thermodynamic analysis.  Economic analysis.",
    "prerequisite": "ENIN 253"
  }
]