[{"short_name": "CHEM 104", "title": "General Chemistry I", "faculty": "CHEM", "credit": "3", "description": "An introduction to the fundamental principles of chemistry. Topics discussed will include atomic structure, bonding, stoichiometry, enthalpy, solutions, organic compounds. Lab component: Introduction to standard chemistry laboratory techniques.", "prerequisite": "CHEM 30 or CHEM 100 (minimum 65%); and Precalculus 30 or Mathematics C30 with a grade of at least 65%, or AMTH 092 with a grade of at least 80%, or MATH 102."}, {"short_name": "CHEM 140", "title": "Organic Chemistry I", "faculty": "CHEM", "credit": "3", "description": "An introduction to organic chemistry. Organic functional groups, nomenclature, reactions and mechanisms. Lab component: Introduction to organic laboratory techniques.", "prerequisite": "CHEM 104"}, {"short_name": "ENGG 123", "title": "Engineering Design and Communications", "faculty": "ENGG", "credit": "3", "description": "Students will be introduced to the concepts of engineering design and communications.  In addition, the consequences of engineering projects on society will be explored.", "prerequisite": ""}, {"short_name": "ENGG 140", "title": "Mechanics for EngineersStatics", "faculty": "ENGG", "credit": "3", "description": "Introduction to engineering mechanics including: force vectors , statics of particles and rigid bodies, centroids, mass centres, construction of free-body diagrams, analysis of structure, internal loads of structures and cables, distributed forces, moments of intertia and friction.", "prerequisite": "MATH 110 (May be take concurrently)"}, {"short_name": "ENGG 100", "title": "Engineering Graphics", "faculty": "ENGG", "credit": "3", "description": "Fundamentals of graphical communication and analysis. Manual and computer-aided sketching and drawing techniques; orthographic and pictorial projections; multi-view, isometric and oblique drawings; basic descriptive geometry; introduction to working drawings.", "prerequisite": ""}, {"short_name": "ENGG 141", "title": "Mechanics for EngineersDynamics", "faculty": "ENGG", "credit": "3", "description": "Engineering applications of mechanical systems; kinematics and kinetics of particles and rigid bodies (such as gears, linkages and other mechanisms), free body diagram  drawing and application sin dynamics, D'Alembert's Principle, work, energy impulse, momentum. Introduction to mechanical vibrations.", "prerequisite": "ENGG 140 and MATH 111 (may be taken concurrently)"}, {"short_name": "ENGG 330", "title": "Engineering Numerical Methods", "faculty": "ENGG", "credit": "3", "description": "Application of numerical methods to engineering problems; topics includes sources and definitions of error, root finding, solutions of linear and non-linear systems of equations, regression, interpolation, numerical integration and differentiation, solution of initial value and boundary value ordinary differential equations.  Introduction to finite difference and finite element methods.  Applications include solving problems with MATLAB and ANSYS.", "prerequisite": " CS 110, MATH 111, MATH 122 and STAT 160 or STAT 289"}, {"short_name": "ENGG 303", "title": "Engineering Economics and Project Management", "faculty": "ENGG", "credit": "3", "description": "Fundamentals of engineering economics and project financials.Social and environmental design making, time value of money, cash flows, interest, equivalence, cost estimation and comparative costing, replacement analysis, capital projects, sensitivity analysis, balance sheets. Project management concepts, skills, tools and techniques including cost, scope, quality, resources, communication, risk, procurement and stakeholder management.", "prerequisite": "STAT 160 or STAT 289 and ECON 201"}, {"short_name": "ENGG 401", "title": "Engineering Law and Professionalism", "faculty": "ENGG", "credit": "3", "description": "Canadian law and professional engineering legislation topics include:  environmental law, tort liability, contracts, tenders, corporations partnerships, patents, industrial design, copyright, trademarks and code of ethics.", "prerequisite": " One of ENEL 400, ENEV 400, ENIN 400, ENPE 400, or ENSE 400"}, {"short_name": "ENGG 411", "title": "Safety Systems Engineering and Management\t\t", "faculty": "ENGG", "credit": "3", "description": "Professional engineering responsibility towards safety includes introduction to health and safety programs; workplace incident assessments; risk hazard identification (from various disciplines); risk management fundamentals; engineering-related legislation, regulations, and codes; studies of best practises and safety management. Content involves engineering design, case analysis, development and use various tools.", "prerequisite": "STAT 160 or STAT 289 and completion of 75 credit hours"}, {"short_name": "MATH 110", "title": "Calculus I", "faculty": "MATH", "credit": "3", "description": "An introductory class in the theory and techniques of differentiation and integration of algebraic and trigonometric functions. Topics include limits, optimization, curve sketching, and areas.", "prerequisite": "Precalculus 30 with at least 75%, or Calculus 30 or Mathematics B30 and C30 with a grade of at least 65% in each or Math 102"}, {"short_name": "MATH 122", "title": "Linear Algebra I", "faculty": "MATH", "credit": "3", "description": "A course intended to introduce students to elementary linear algebra, particularly at a computational and applied level. Topics include matrices and systems of equations, inversion, determinants, vectors, inner products, eigenvectors and eigenvalues.", "prerequisite": "Precalculus 30, Mathematics B30 and C30, or Math 102."}, {"short_name": "MATH 111", "title": "Calculus II", "faculty": "MATH", "credit": "3", "description": "Differentiation and integration of exponential and logarithmic functions; methods of integration and applications; indeterminate forms, L'Hospital's rule and improper integrals; sequences, series, power series and Taylor series.", "prerequisite": "MATH 110, or MATH 103 with a grade of at least 80%"}, {"short_name": "MATH 213", "title": "Vector Calculus", "faculty": "MATH", "credit": "3", "description": "A study of vector functions and functions of several variables and their derivatives; Applied maximum and minimum problems, Lagrange multipliers, multiple integration, integration in polar, cylindrical and spherical coordinates; Green's, Stokes' and the Divergence Theorem.", "prerequisite": "MATH 111 and 122"}, {"short_name": "CS 110", "title": "Programming and Problem Solving", "faculty": "CS", "credit": "3", "description": "An introduction to problem-solving techniques, the fundamental concepts of programming, and the software design process. Topics will include: data types, control structures, scope rules, functions, files, and the mechanics of running, testing and debugging. Problems will be drawn from various science disciplines.", "prerequisite": "Precalculus 30, Calculus 30, or Math 102"}, {"short_name": "ENGL 100", "title": "Critical Reading and Writing I", "faculty": "ENGL", "credit": "3", "description": "This course develops students' proficiency in critical reading and writing through the study of a wide range of non-literary and literary texts, and the study of composition, with emphasis on connections between modes of reading and writing.", "prerequisite": ""}, {"short_name": "PHYS 119", "title": "General Physics II", "faculty": "PHYS", "credit": "3", "description": "A continuation of PHYS 109: Fluid mechanics, heat and thermodynamics, waves, sound, radiation, electrostatics and electric current.", "prerequisite": "PHYS 109 or ENGG 140"}, {"short_name": "ENEV 223", "title": "Engineering, Environment, and Society", "faculty": "ENEV", "credit": "3", "description": "Introduction and application of environmental design in engineering practice, including public health and safety, environmental ethics, resource and energy systems, impacts of technology on society, sustainable development and environmental stewardship.", "prerequisite": "ENGG 123"}, {"short_name": "ENEV 372", "title": "Transportation Systems", "faculty": "ENEV", "credit": "3", "description": "Introduction to transportation as a system; roles of transportation in society; the technology of transportation; the transportation system and its environment; introduction to planning and management of regional transportation facilities.", "prerequisite": "CS 110 and ENGG 240 or ENGG 141 (concurrent enrolment is allowed)"}, {"short_name": "ENEV 261", "title": "Engineering Fluid Mechanics", "faculty": "ENEV", "credit": "3", "description": "Properties of fluids, pressure and fluid statics, mass, energy and momentum principles, Bernoulli and energy equations, steady state internal flow in pipe systems, flow measurement, external flow drag and lift, dimensional analysis.", "prerequisite": " ENGG 141 (or ENGG 240) and PHYS 199 (or PHYS 109) and completion of 45 Credit Hours."}, {"short_name": "ENEV 321", "title": "Applied Environmental Science", "faculty": "ENEV", "credit": "3", "description": "Study of biochemical effects of human activities on the environment; ecology and environmental pollution; materials and energy balances; chemical systems; basic concepts of aquatic and soil chemistry; water resources; transport phenomena; water pollution; human health risk assessment; water quality and treatment; wastewater treatment; public health aspects.", "prerequisite": "CHEM 104"}, {"short_name": "ENEV 281", "title": "Surveying, Mapping and Information Systems", "faculty": "ENEV", "credit": "3", "description": "Fundamental principles and methods of surveying fieldwork and computations. Concurrent lectures, fieldwork, and office work. Spatial information systems.", "prerequisite": " ENGG 123"}, {"short_name": "ENEV 334", "title": "Simulation & Decision Making for Engineers", "faculty": "ENEV", "credit": "3", "description": "Simulation and decision making for environmental engineering systems and problems such as contamination, floods, and traffic. Topics include numerical methods, distributions, regression, hypothesis testing, modelling, and risk analyses.", "prerequisite": "STAT 160 or STAT 289"}, {"short_name": "ENEV 384", "title": "Engineering Materials", "faculty": "ENEV", "credit": "3", "description": "Structure and properties of engineering materials, particularly steel, aggregate, and asphalt and Portland cement concretes. Introduction to soils. Environmental aspects of materials.", "prerequisite": "CHEM 104"}, {"short_name": "ENEV 480", "title": "Terrain and Site Analysis", "faculty": "ENEV", "credit": "3", "description": "The application of airphoto, satellite imagery and geomorphological interpretation to regional engineering problems, to management of resources, and to monitoring of the environment. On-site investigation techniques.", "prerequisite": "GEOL 102"}, {"short_name": "ENEV 360", "title": "Environmental Hydraulics", "faculty": "ENEV", "credit": "3", "description": "Momentum, mass and energy balances in the design, synthesis and analysis of flow in pipes, open channels and porous media ; pumps; turbines; dams; spillways; culverts; diversion, conveyance and control structures.", "prerequisite": "ENEV 261"}, {"short_name": "ENEV 421", "title": "Environmental Design and Impact", "faculty": "ENEV", "credit": "3", "description": "Environmental factors and their assessment with particular reference to engineering projects.  Topics include mitigation measures and standards.", "prerequisite": "ENEV 321"}, {"short_name": "ENEV 422", "title": "Solid and Hazardous Waste Management", "faculty": "ENEV", "credit": "3", "description": "Legislative trends; sources and characteristics of municipal solid waste; Recycling waste materials; Collection, transfer and transport; Disposal options; Sanitary landfill, incineration, composting and bioconversion; Management and Planning; Hazardous Waste-Problems, impacts and treatment/ disposal.", "prerequisite": "ENEV 223"}, {"short_name": "ENEV 440", "title": "Air Pollution Engineering", "faculty": "ENEV", "credit": "3", "description": "Air pollution effects and control regulations, atmospheric chemistry, air quality detection, pollution meteorology, air quality, modeling, air pollution control, techniques, and global atmospheric problems.", "prerequisite": "ENEV 321"}, {"short_name": "ENEV 462", "title": "Engineering Hydrology", "faculty": "ENEV", "credit": "3", "description": "Introductory engineering hydrology course. Topics include rainfall, snowmelt, infiltration, evaporation, streamflow, flood frequency analysis, flood routing, and runoff modeling.", "prerequisite": " ENEV 261 and CS 110"}, {"short_name": "ENEV 363", "title": "Water and Wastewater Engineering", "faculty": "ENEV", "credit": "3", "description": "The theory and design of systems and system components used in water treatment and distribution and in wastewater collection and treatment.", "prerequisite": "ENEV 321"}, {"short_name": "ENEV 383", "title": "Geotechnical Engineering", "faculty": "ENEV", "credit": "3", "description": "Soil properties, water movement and seepage, stress distribution in soil masses, consolidation and settlement, lateral shear stress, slope stability analysis, shallow foundation design and retaining wall design.  Emphasis will be on the environmental problems with the soil.", "prerequisite": "ENIN 241 and ENEV 384"}, {"short_name": "ENEV 400", "title": "EVSE Project Start-up", "faculty": "ENEV", "credit": "1", "description": "In this course a team design project for ENEV 415 is selected, preliminary project information gathered, and a project plan prepared.  Students are advised to coordinate the chosen project topic with their approved electives in order to be better prepared for the completion of their ENEV 415 project.", "prerequisite": "ENEV 321, ENEV 440 and successful completion of 99 credit hours or permission of EVSE Program Chair."}, {"short_name": "ENEV 435", "title": "Engineering Project Management", "faculty": "ENEV", "credit": "3", "description": "Fundamentals of project management in an engineering environment. Support functions of time management and conflict resolution. Performance management. Project planning, scheduling and cost control. Contracts, warranties and liabilities. Special topics.", "prerequisite": "ENEV 334"}, {"short_name": "ENEV 415", "title": "Environmental Systems Engineering Design Project and Communications", "faculty": "ENEV", "credit": "3", "description": "Preparation and presentation of a report on an approved systems engineering design project.  Basics of preparing and presenting engineering reports.", "prerequisite": "ENEV 400"}, {"short_name": "ENEV 469", "title": "Groundwater Development & Contaminant Transport", "faculty": "ENEV", "credit": "3", "description": "Basic principles of fluid flow in saturated and unsaturated materials, well problems, groundwater quality, discussion of salt water intrusion, and modeling of groundwater flow and contaminant transport.", "prerequisite": " ENEV 462 and ENEV 383.  Concurrent enrolment allowed in ENEV 462"}, {"short_name": "ENEV 408", "title": "Basic Structural Design", "faculty": "ENEV", "credit": "3", "description": "Design concepts and practices for simple beams, columns, connectors and structures in wood, steel and reinforced concrete. Basic types and problems in design of foundations.", "prerequisite": "ENIN 241, ENGG 240 or ENGG 141 and ENEV 384"}, {"short_name": "ENEV 445", "title": "Advanced Air Pollution Enginee", "faculty": "ENEV", "credit": "3", "description": "Principles of process design and cost estimation for air pollution control, design and operation of auxilliary equipment for transport and cooling waste gas streams, control of carbon dioxide, indoor air quality and control strategy.", "prerequisite": "ENEV 440 and ENIN 253"}, {"short_name": "ENEV 463", "title": "Water Resources Systems", "faculty": "ENEV", "credit": "3", "description": "Water resources planning and management. Topics include planning for hydroelectric, flood control, water supply and irrigation projects; stochastic processes; synthetic streamflow generation; simulation and optimization of water resource systems.", "prerequisite": "ENEV 462"}, {"short_name": "ENEV 475", "title": "Traffic Engineering", "faculty": "ENEV", "credit": "3", "description": "Study of the characteristics of traffic flow and methods of traffic control; introduction to traffic flow and queuing theory; roadway capacity and level of service analysis; speed and volume studies; traffic signs and signalization; computer control systems; and, accident analysis.", "prerequisite": "ENEV 372"}, {"short_name": "ENEV 484", "title": "Highway Design", "faculty": "ENEV", "credit": "3", "description": "Detailed geometric design of highways; functional and detailed geometric design of at-grade and grade separated intersections; and, introduction to design of flexible and rigid pavements.", "prerequisite": "ENEV 281, 372, and 384"}, {"short_name": "GEOL 102", "title": "Environmental Geology", "faculty": "GEOL", "credit": "3", "description": "The nature of the earth.  Plate tectonics and the geological time scale.  Earthquakes, volcanism and surface processes with reference to their effect on the human environment. Earth resources, waste disposal, and pollution in a geological context.", "prerequisite": ""}, {"short_name": "ECON 201", "title": "Introductory Microeconomics", "faculty": "ECON", "credit": "3", "description": "Theory of how individual consumers and firms behave in a market economy. Emphasis is on evaluating how well markets deliver efficient and fair outcomes.", "prerequisite": "15 credit hours or ECON 100 or Pre-Calculus 20 (or equivalent)"}, {"short_name": "ENIN 241", "title": "Mechanics of Deformable Solids", "faculty": "ENIN", "credit": "3", "description": "Introductory mechanics of materials, stresses and strains in two dimensions, torsion, indeterminate systems, beams - stresses and deflection, combined stresses, thin shells, columns, and Mohr's circle for stress and strain.", "prerequisite": "ENGG 240 or ENGG 141 and MATH 111"}, {"short_name": "ENIN 253", "title": "Engineering Thermodynamics", "faculty": "ENIN", "credit": "3", "description": "Fundamental laws of thermodynamics and their application to various engineering systems. Ideal and actual processes, power and refrigeration cycles.", "prerequisite": "PHYS 119"}, {"short_name": "ENIN 350", "title": "Chemical Manufacturing Process", "faculty": "ENIN", "credit": "3", "description": "Mass and energy balances in chemical process industries. Applications including the petrochemical, pulp and paper, and mining industries.  Environmental problems, thermodynamics, stoichiometry, chemical reactions, and computer applications.", "prerequisite": "CHEM 104 and ENIN 253 (concurrent enrolment is allowed)"}, {"short_name": "ENIN 453", "title": "Mechanical Systems Equipment", "faculty": "ENIN", "credit": "3", "description": "Design, operation, and application characteristics of service equipment commonly used in manufacturing and process plant operations and facilities.  Topics include compressors, pumps, piping systems, valves, hydraulic systems, fans, and heat exchangers.", "prerequisite": " ENIN 253 and ENEV 261"}, {"short_name": "ENIN 455", "title": "Energy Systems", "faculty": "ENIN", "credit": "3", "description": "Examination of a variety of existing and potential systems involving production, consumption, and environmental impact of chemical, electrical, and mechanical energy.  Energy systems.  Heat transfer and thermodynamic analysis.  Economic analysis.", "prerequisite": "ENIN 253"}, {"short_name": "STAT 289", "title": "Statistics for Engineers", "faculty": "STAT", "credit": "3", "description": "Topics include probability, discrete and continuous distributions, the central limit theorem, confidence intervals and hypothesis tests for one and two samples, linear regression and correlation.", "prerequisite": "MATH 111"}, {"short_name": "ENPE 490", "title": "Petroleum Waste Management", "faculty": "ENPE", "credit": "3", "description": "Prevention and mitigation techniques in pipeline and oil field spills.  Downhole disposal of waste fluids, surface disposal of oil field wastes, fire and other hazards, H2S and other toxic gases, and safety standards.", "prerequisite": " ENPE 300 or ENEV 320 or ENEV 223"}, {"short_name": "BUS 260", "title": "Introduction to Organizational Behaviour", "faculty": "BUS", "credit": "3", "description": "This introductory course addresses the basic concepts and processes of organizational behaviour. Topics will include:  individual level variables, such as perception, personality, attitudes, and motivation; interpersonal and group processes, such as communication, teams, leadership, and power; and, organizational level factors such as organizational design, culture, and change.", "prerequisite": "ENGL 100, or ACAD 100, or KIN 101."}, {"short_name": "BUS 302", "title": "Entrepreneurship: Small Business Modeling and Feasibility Analysis", "faculty": "BUS", "credit": "3", "description": "This course addresses early stage elements of starting up and operating a small business on a conceptual level. Using cases, competitions and experiential exercises, students will learn opportunity alertness and identification, building a value proposition, testing business hypotheses, creating competitive advantage, setting up financials, analyzing break even, charting growth and planning for exit. Students develop, build and test an entrepreneurial opportunity they identify, and assess its feasibility. The course applies to all business start up including non profit, for profit, for benefit and corporate or institutional intrapreneurship.", "prerequisite": "Completion of a minimum of 30 credit hours of university studies."}, {"short_name": "ENEL 280", "title": "Electrical Circuits", "faculty": "ENEL", "credit": "3", "description": "DC circuits, Kirchoff's voltage and current laws, equivalent circuits, introduction to mesh and nodal methods, superposition, maximum power transfer, capacitors,\ninductors, transient analysis of RL and RC circuits, introduction to AC steady\nstate analysis, introduction to electrical safety in engineering.", "prerequisite": "Math 111"}]