[
    {
        "short_name": "CHEM 104",
        "title": "General Chemistry I",
        "faculty": "CHEM",
        "credit": "3",
        "description": "An introduction to the fundamental principles of chemistry. Topics discussed will include atomic structure, bonding, stoichiometry, enthalpy, solutions, organic compounds. Lab component: Introduction to standard chemistry laboratory techniques.",
        "prerequisite": "CHEM 30 or CHEM 100 (minimum 65%); and Precalculus 30 or Mathematics C30 with a grade of at least 65%, or AMTH 092 with a grade of at least 80%, or MATH 102."
    },
    {
        "short_name": "CHEM 140",
        "title": "Organic Chemistry I",
        "faculty": "CHEM",
        "credit": "3",
        "description": "An introduction to organic chemistry. Organic functional groups, nomenclature, reactions and mechanisms. Lab component: Introduction to organic laboratory techniques.",
        "prerequisite": "CHEM 104"
    },
    {
        "short_name": "ENGG 123",
        "title": "Engineering Design and Communications",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Students will be introduced to the concepts of engineering design and communications.  In addition, the consequences of engineering projects on society will be explored.",
        "prerequisite": ""
    },
    {
        "short_name": "ENGG 140",
        "title": "Mechanics for EngineersStatics",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Introduction to engineering mechanics including: force vectors , statics of particles and rigid bodies, centroids, mass centres, construction of free-body diagrams, analysis of structure, internal loads of structures and cables, distributed forces, moments of intertia and friction.",
        "prerequisite": "MATH 110 (May be take concurrently)"
    },
    {
        "short_name": "ENGG 100",
        "title": "Engineering Graphics",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Fundamentals of graphical communication and analysis. Manual and computer-aided sketching and drawing techniques; orthographic and pictorial projections; multi-view, isometric and oblique drawings; basic descriptive geometry; introduction to working drawings.",
        "prerequisite": ""
    },
    {
        "short_name": "ENGG 141",
        "title": "Mechanics for EngineersDynamics",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Engineering applications of mechanical systems; kinematics and kinetics of particles and rigid bodies (such as gears, linkages and other mechanisms), free body diagram  drawing and application sin dynamics, D'Alembert's Principle, work, energy impulse, momentum. Introduction to mechanical vibrations.",
        "prerequisite": "ENGG 140 and MATH 111 (may be taken concurrently)"
    },
    {
        "short_name": "ENGG 303",
        "title": "Engineering Economics and Project Management",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Fundamentals of engineering economics and project financials.Social and environmental design making, time value of money, cash flows, interest, equivalence, cost estimation and comparative costing, replacement analysis, capital projects, sensitivity analysis, balance sheets. Project management concepts, skills, tools and techniques including cost, scope, quality, resources, communication, risk, procurement and stakeholder management.",
        "prerequisite": "STAT 160 or STAT 289 and ECON 201"
    },
    {
        "short_name": "ENGG 330",
        "title": "Engineering Numerical Methods",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Application of numerical methods to engineering problems; topics includes sources and definitions of error, root finding, solutions of linear and non-linear systems of equations, regression, interpolation, numerical integration and differentiation, solution of initial value and boundary value ordinary differential equations.  Introduction to finite difference and finite element methods.  Applications include solving problems with MATLAB and ANSYS.",
        "prerequisite": " CS 110, MATH 111, MATH 122 and STAT 160 or STAT 289"
    },
    {
        "short_name": "ENGG 401",
        "title": "Engineering Law and Professionalism",
        "faculty": "ENGG",
        "credit": "3",
        "description": "Canadian law and professional engineering legislation topics include:  environmental law, tort liability, contracts, tenders, corporations partnerships, patents, industrial design, copyright, trademarks and code of ethics.",
        "prerequisite": " One of ENEL 400, ENEV 400, ENIN 400, ENPE 400, or ENSE 400"
    },
    {
        "short_name": "MATH 110",
        "title": "Calculus I",
        "faculty": "MATH",
        "credit": "3",
        "description": "An introductory class in the theory and techniques of differentiation and integration of algebraic and trigonometric functions. Topics include limits, optimization, curve sketching, and areas.",
        "prerequisite": "Precalculus 30 with at least 75%, or Calculus 30 or Mathematics B30 and C30 with a grade of at least 65% in each or Math 102"
    },
    {
        "short_name": "MATH 122",
        "title": "Linear Algebra I",
        "faculty": "MATH",
        "credit": "3",
        "description": "A course intended to introduce students to elementary linear algebra, particularly at a computational and applied level. Topics include matrices and systems of equations, inversion, determinants, vectors, inner products, eigenvectors and eigenvalues.",
        "prerequisite": "Precalculus 30, Mathematics B30 and C30, or Math 102."
    },
    {
        "short_name": "MATH 111",
        "title": "Calculus II",
        "faculty": "MATH",
        "credit": "3",
        "description": "Differentiation and integration of exponential and logarithmic functions; methods of integration and applications; indeterminate forms, L'Hospital's rule and improper integrals; sequences, series, power series and Taylor series.",
        "prerequisite": "MATH 110, or MATH 103 with a grade of at least 80%"
    },
    {
        "short_name": "MATH 217",
        "title": "Differential Equations I",
        "faculty": "MATH",
        "credit": "3",
        "description": "Ordinary differential equations, modelling with differential equations, Laplace transforms.",
        "prerequisite": "MATH 111 and MATH 122"
    },
    {
        "short_name": "MATH 213",
        "title": "Vector Calculus",
        "faculty": "MATH",
        "credit": "3",
        "description": "A study of vector functions and functions of several variables and their derivatives; Applied maximum and minimum problems, Lagrange multipliers, multiple integration, integration in polar, cylindrical and spherical coordinates; Green's, Stokes' and the Divergence Theorem.",
        "prerequisite": "MATH 111 and 122"
    },
    {
        "short_name": "CS 110",
        "title": "Programming and Problem Solving",
        "faculty": "CS",
        "credit": "3",
        "description": "An introduction to problem-solving techniques, the fundamental concepts of programming, and the software design process. Topics will include: data types, control structures, scope rules, functions, files, and the mechanics of running, testing and debugging. Problems will be drawn from various science disciplines.",
        "prerequisite": "Precalculus 30, Calculus 30, or Math 102"
    },
    {
        "short_name": "ENGL 100",
        "title": "Critical Reading and Writing I",
        "faculty": "ENGL",
        "credit": "3",
        "description": "This course develops students' proficiency in critical reading and writing through the study of a wide range of non-literary and literary texts, and the study of composition, with emphasis on connections between modes of reading and writing.",
        "prerequisite": ""
    },
    {
        "short_name": "PHYS 119",
        "title": "General Physics II",
        "faculty": "PHYS",
        "credit": "3",
        "description": "A continuation of PHYS 109: Fluid mechanics, heat and thermodynamics, waves, sound, radiation, electrostatics and electric current.",
        "prerequisite": "PHYS 109 or ENGG 140"
    },
    {
        "short_name": "ENEL 280",
        "title": "Electrical Circuits",
        "faculty": "ENEL",
        "credit": "3",
        "description": "DC circuits, Kirchoff's voltage and current laws, equivalent circuits, introduction to mesh and nodal methods, superposition, maximum power transfer, capacitors,\ninductors, transient analysis of RL and RC circuits, introduction to AC steady\nstate analysis, introduction to electrical safety in engineering.",
        "prerequisite": "Math 111"
    },
    {
        "short_name": "ENPE 241",
        "title": "Introduction to Petroleum Engineering",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Exposure to various disciplines within petroleum engineering including drilling, production, and reservoir engineering; professionalism and ethics in petroleum engineering.",
        "prerequisite": " GEOL 102"
    },
    {
        "short_name": "ENPE 251",
        "title": "Reservoir Fluid Properties",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Qualitative and quantitative phase behavior of petroleum reservoir fluids through the algebraic and numerical application of thermodynamic theory, equations of state, and empirical correlations; determination of engineering PVT parameters; and, phase behaviour of hydrocarbon systems.",
        "prerequisite": "MATH 217 (concurrent enrolment allowed)"
    },
    {
        "short_name": "ENPE 300",
        "title": "Fundamentals of Reservoir Engineering",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Relationship of geology, basic reservoir properties, surface and interfacial phenomena, and the flow of fluids through porous media; general material balance, steady state, and transient models; classification of petroleum reservoirs, displacement of oil and gas, and reservoir estimation principles.",
        "prerequisite": "ENPE 241 and 251"
    },
    {
        "short_name": "ENPE 360",
        "title": "Drilling Engineering",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Drilling fluids, rotary drilling, drilling hydraulics, formation  pore pressure and fracture resistance, casing design, directional drilling, horizontal drilling and drilling waster disposal.",
        "prerequisite": "ENPE 300 and ENEV 261 (concurrent enrollment allowed for both)"
    },
    {
        "short_name": "ENPE 302",
        "title": "Applied Reservoir Engineering",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Analysis and prediction of reservoir performance by use of material balance. Reservoir performance by use of decline curves.  Pressure maintenance, oil trapping, capillary number correlations, fluid displacement, fractional flow, displacement efficiency, areal and vertical sweep efficiencies, waterflooding design, and gas injections.",
        "prerequisite": "ENPE 300"
    },
    {
        "short_name": "ENPE 370",
        "title": "Petroleum Production Operations",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Principles of oil and gas production. Artificial lift, inflow performance relationships, introduction to well stimulation, and production system design.",
        "prerequisite": "ENPE 300 and ENEV 261"
    },
    {
        "short_name": "ENPE 400",
        "title": "PSE Project Start-up",
        "faculty": "ENPE",
        "credit": "1",
        "description": "Definition of petroleum engineering design problems; identification of projects' topics, partners, and supervisors; proposal writing for engineering projects; approaches for carrying out the research and design; and, approaches for communicating research and design results.",
        "prerequisite": "Completion of all the required 200 and 300 level ENPE courses and successful completion of 99 credit hours"
    },
    {
        "short_name": "ENPE 410",
        "title": "Enhanced Oil Recovery Methods",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Displacement processes for recovering additional hydrocarbons.  Waterflooding, gas flooding, solvent flooding, and thermal recovery processes.  Development of design techniques.",
        "prerequisite": "ENPE 302"
    },
    {
        "short_name": "ENPE 440",
        "title": "Well Logging and Formation Evaluation",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Fundamentals of well logging for the determination of petrophysical properties in the near bore region, types of well logging devices, and applications of well logs for petroleum system management.",
        "prerequisite": "ENPE 241 and ENPE 360 (may be taken concurrently)"
    },
    {
        "short_name": "ENPE 450",
        "title": "Well Testing",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Basic principles of well testing and interpretation for oil and gas production, pressure transient theory, principles of superposition, and application of well testing to homogeneous and heterogeneous reservoirs.",
        "prerequisite": "ENPE 300 and ENPE 360 (may be taken concurrently)"
    },
    {
        "short_name": "ENPE 419",
        "title": "PSE Design Project and Communications",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Student's team design project is to be completed in an acceptable written and oral report form.  Instructions will be given on the preparation and presentation of the engineering report related to the petroleum industry.",
        "prerequisite": " ENPE 400"
    },
    {
        "short_name": "ENPE 486",
        "title": "Heavy Oil Recovery",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Thermal Recovery Methods, theory and practice of thermal recovery methods; steam drive, cyclic steam injections, and insitu combustion.  Models of combined mass energy transport.  Estimates of heated reservoir volume and oil recovery performance.  Wellbore heat losses and recovery production.",
        "prerequisite": "ENPE 302, 370 and ENIN 355"
    },
    {
        "short_name": "ENPE 340",
        "title": "Rock Mechanics",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Stress and strain tensors, rock elasticity, mechanical properties of rocks, effective stress concept, anisotropy, time-dependent effects, constitutive modeling of rocks, failure mechanics, rock properties from laboratory experiments, rock properties from from field data.",
        "prerequisite": "ENGG 240 and ENPE 300"
    },
    {
        "short_name": "ENPE 380",
        "title": "Petroleum Treating Operations",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Petroleum treating processes.  Multiphase Seperation equipment design and operations; hydrocyclones, desalination, dehydration, hydrate, prevention, emulsion treating, and viscosity altering processes.",
        "prerequisite": "ENIN 355"
    },
    {
        "short_name": "ENPE 435",
        "title": "Reservoir Stimulation",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Formation damage mechanisms, introduction to reservoir stimulation techniques, matrix acidizing operation design, sandstone acidizing, carbonate acidizing, placement and diversion methods, introduction to rock mechanics, acid fracturing operations, hydraulic fracturing operations, fracture treatment design, treatment analysis and post-treatment evaluation.",
        "prerequisite": "ENPE 370"
    },
    {
        "short_name": "ENPE 448",
        "title": "Reservoir Characterization",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Review petroleum reservoir geology, geological depositional environments, petrophysical and geostatistical analysis, and reserves estimation based on static and dynamic reservoir information.  Emphasis on data analysis and integration for a model suitable for reservoir simulation.",
        "prerequisite": "ENPE 440 (may be taken concurrently)"
    },
    {
        "short_name": "ENPE 470",
        "title": "Reservoir Modelling",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Fundamentals of modeling in petroleum engineering.  Simulation methods as applied to specific problems in petroleum reservoir behavior; examples will be drawn from primary, secondary, and tertiary recovery phases of petroleum production.",
        "prerequisite": "ENPE 410 (concurrent enrolment is allowed) and ENGG 330"
    },
    {
        "short_name": "ENPE 475",
        "title": "Evaluation of Oil and Gas Properties",
        "faculty": "ENPE",
        "credit": "3",
        "description": "General business skills related to the understanding of oil field cash flow projections, rate of return, royalties, taxes and other factors in measuring value creation as it relates to the petroleum industry.",
        "prerequisite": " ENPE 302, ENPE 440 and ENGG 303"
    },
    {
        "short_name": "ENPE 490",
        "title": "Petroleum Waste Management",
        "faculty": "ENPE",
        "credit": "3",
        "description": "Prevention and mitigation techniques in pipeline and oil field spills.  Downhole disposal of waste fluids, surface disposal of oil field wastes, fire and other hazards, H2S and other toxic gases, and safety standards.",
        "prerequisite": " ENPE 300 or ENEV 320 or ENEV 223"
    },
    {
        "short_name": "ENPE 491",
        "title": "Carbon Capture, Utilization and Geo-sequestration",
        "faculty": "ENPE",
        "credit": "3",
        "description": "This course will cover global climate change impacts,  sources of greenhouse gas emissions, as well as the benefits and applications of carbon capture technologies for the petroleum industry, sequestration in oil and gas reservoirs and deep saline aquifers. Additionally, CCS policies and regulatory development will be explored.",
        "prerequisite": "ENPE 300 and ENIN 355"
    },
    {
        "short_name": "ENPE 492",
        "title": "Introduction to Petroleum Refinery",
        "faculty": "ENPE",
        "credit": "3",
        "description": "In this course students will become familiar with the basic principles of petroleum refinary operations. Composition of crude oils, related laboratory tests and refinery feedstocks and products will be discussed. Evaluation of crude oil properties and design of distillation columns, furnace, thermal and catalytic cracking, catalytic reforming, hydrotreating, hydrocracking, isomerization, alkylation and polymerization will be introduced.",
        "prerequisite": "ENIN 355"
    },
    {
        "short_name": "GEOL 102",
        "title": "Environmental Geology",
        "faculty": "GEOL",
        "credit": "3",
        "description": "The nature of the earth.  Plate tectonics and the geological time scale.  Earthquakes, volcanism and surface processes with reference to their effect on the human environment. Earth resources, waste disposal, and pollution in a geological context.",
        "prerequisite": ""
    },
    {
        "short_name": "GEOL 270",
        "title": "Earth Resources and the Environment",
        "faculty": "GEOL",
        "credit": "3",
        "description": "An intermediate course focused on origin, global distribution, use and environmental impact of earth resources, metallic minerals, energy resources, industrial minerals, and the social, economic and political implications of mineral resources.",
        "prerequisite": "GEOL 102"
    },
    {
        "short_name": "ECON 201",
        "title": "Introductory Microeconomics",
        "faculty": "ECON",
        "credit": "3",
        "description": "Theory of how individual consumers and firms behave in a market economy. Emphasis is on evaluating how well markets deliver efficient and fair outcomes.",
        "prerequisite": "15 credit hours or ECON 100 or Pre-Calculus 20 (or equivalent)"
    },
    {
        "short_name": "ENIN 233",
        "title": "System Dynamics",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Lumped parameter linear analysis methods for mechanical, electrical, fluid and thermal systems.  Linear differential equations to analyze system response to step and sinusoidal forcing functions.  Analogous nature of these systems.",
        "prerequisite": " MATH 217"
    },
    {
        "short_name": "ENIN 253",
        "title": "Engineering Thermodynamics",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Fundamental laws of thermodynamics and their application to various engineering systems. Ideal and actual processes, power and refrigeration cycles.",
        "prerequisite": "PHYS 119"
    },
    {
        "short_name": "ENIN 350",
        "title": "Chemical Manufacturing Process",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Mass and energy balances in chemical process industries. Applications including the petrochemical, pulp and paper, and mining industries.  Environmental problems, thermodynamics, stoichiometry, chemical reactions, and computer applications.",
        "prerequisite": "CHEM 104 and ENIN 253 (concurrent enrolment is allowed)"
    },
    {
        "short_name": "ENIN 355",
        "title": "Heat Mass and Momentum Transfer",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Differential equations of momentum, heat and mass transfer; dimensional analysis; heat conduction and convection; boiling and condensation; molecular diffusion; convective mass transfer; and, analogies between momentum, heat and mass transfer.",
        "prerequisite": " ENEV 261 and ENIN 350"
    },
    {
        "short_name": "ENIN 433",
        "title": "Risk Assessment and Decision Analysis",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Probability of failure, hazards analysis, human reliability, reliability assessment, event tree and fault tree analysis and risk-based decision-making; decision consideration, inspection, testing and maintenance for critical components.",
        "prerequisite": "STAT 160 or STAT 289 and MATH 217"
    },
    {
        "short_name": "ENIN 453",
        "title": "Mechanical Systems Equipment",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Design, operation, and application characteristics of service equipment commonly used in manufacturing and process plant operations and facilities.  Topics include compressors, pumps, piping systems, valves, hydraulic systems, fans, and heat exchangers.",
        "prerequisite": " ENIN 253 and ENEV 261"
    },
    {
        "short_name": "ENIN 456",
        "title": "Process Unit Operations and Design",
        "faculty": "ENIN",
        "credit": "3",
        "description": "Principles and equipment design for momentum, heat, and mass transfer operations in industries such as petrochemical and refining, mining and mineral processing, pulp and paper, and food processing.",
        "prerequisite": " ENIN 355"
    },
    {
        "short_name": "STAT 289",
        "title": "Statistics for Engineers",
        "faculty": "STAT",
        "credit": "3",
        "description": "Topics include probability, discrete and continuous distributions, the central limit theorem, confidence intervals and hypothesis tests for one and two samples, linear regression and correlation.",
        "prerequisite": "MATH 111"
    },
    {
        "short_name": "BUS 260",
        "title": "Introduction to Organizational Behaviour",
        "faculty": "BUS",
        "credit": "3",
        "description": "This introductory course addresses the basic concepts and processes of organizational behaviour. Topics will include:  individual level variables, such as perception, personality, attitudes, and motivation; interpersonal and group processes, such as communication, teams, leadership, and power; and, organizational level factors such as organizational design, culture, and change.",
        "prerequisite": "ENGL 100, or ACAD 100, or KIN 101."
    },
    {
        "short_name": "ENEV 422",
        "title": "Solid and Hazardous Waste Management",
        "faculty": "ENEV",
        "credit": "3",
        "description": "Legislative trends; sources and characteristics of municipal solid waste; Recycling waste materials; Collection, transfer and transport; Disposal options; Sanitary landfill, incineration, composting and bioconversion; Management and Planning; Hazardous Waste-Problems, impacts and treatment/ disposal.",
        "prerequisite": "ENEV 223"
    }
]